<?php 
/**
 * -- CÁC THAM SỐ CƠ BẢN ---------------------------------------------------------
 * @ $thangam
 * @ $canngay
 * @ $chingay
 * -- CÁC MẢNG DỮ LIỆU TRẢ VỀ ----------------------------------------------------
 * 
 * @ $can: mảng can.
 * @ $chi: mảng chi.
 * @ $tietkhi: mảng tiết khí.
 * @ $nguhanh: mảng ngũ hành.
 * @ $cattinhnhatthan_thangam_canngay: mảng cát tinh nhật thần theo tháng âm và can ngày.
 * @ $cattinhnhatthan_thangam_chingay: mảng cát tinh nhật thần theo tháng âm và chi ngày.
 * @ $cattinhnhatthan_thangam_canngay_chingay: mảng cát tinh nhật thần đặc biệt theo tháng âm và can ngày và chi ngày.
 * @ $ngayhoangdao: mảng ngày hoàng đạo.
 * @ $saohungtinh_thangam_canngay: mảng sao hung tinh theo tháng âm và can ngày.
 * @ $saohungtinh_thangam_canngay_chingay: mảng sao hung tinh theo tháng âm và can ngày và chi ngày.
 * @ $saohungtinh_thangam_chingay: mảng sao hung tinh theo tháng âm và chi ngày.
 * -- CÁC MẢNG DỮ LIỆU DÙNG ĐỂ XÁC ĐỊNH DỮ LIỆU TRẢ VỀ ---------------------------
 * 
 * @ $xd_nguhanh : Mảng xác định ngũ hành.
 * @ $xd_cattinhnhatthan_thangam_canngay : Mảng xác định cát tinh nhật thần theo tháng âm và can ngày.
 * @ $xd_cattinhnhatthan_thangam_chingay: Mảng xác định cát tinh nhật thần theo tháng âm và chi ngày.
 * @ $xd_cattinhnhatthandacbiet_thangam_canngay :Mảng xác định cát tinh nhật thần đặc biệt theo tháng âm, can ngày .
 * @ $xd_cattinhnhatthandacbiet_thangam_chingay :Mảng xác định cát tinh nhật thần đặc biệt theo tháng âm  và chi ngày.
 * @ $xd_cattinhnhatthandacbiet_thangam_canngay_chingay :Mảng xác định cát tinh nhật thần đặc biệt theo tháng âm, can ngày và chi ngày.
 * @ $xd_ngayhoangdao : Mảng xác định ngày hoàng đạo.
 * @ $xd_saohungtinh_thangam_canngay: Mảng xác định sao hung tinh theo tháng âm và can ngày.
 * @ $xd_saohungtinh_thangam_chingay: Mảng xác định sao hung tinh theo tháng âm và chi ngày.
 * @ $xd_saohungtinh_thangam_canngay_chingay : mảng xác định sao hung tinh theo tháng âm, can ngày và chi ngày.
 * 
 * 
 * 
 **/ 
defined('BASEPATH') OR exit('No direct script access allowed');

class Lib_xemngay{
        public $ngayduong;
        public $thangduong;
        public $namduong;
        public $ngayam;
        public $thangam;
        public $namam;
        public $canngay;
        public $chingay;
        
        public $can = array(
                               '1' => 'Giáp',
                               '2' => 'Ất',
                               '3' => 'Bính',
                               '4' => 'Đinh',
                               '5' => 'Mậu',
                               '6' => 'Kỷ',
                               '7' => 'Canh',
                               '8' => 'Tân',
                               '9' => 'Nhâm',
                               '10'=> 'Quý'
                           );
        
        public $chi = array(
                                '1' => 'Tý',
                                '2' => 'Sửu',
                                '3' => 'Dần',
                                '4' => 'Mão',
                                '5' => 'Thìn',
                                '6' => 'Tỵ',
                                '7' => 'Ngọ',
                                '8' => 'Mùi',
                                '9' => 'Thân',
                                '10'=> 'Dậu',
                                '11'=> 'Tuất',
                                '12'=> 'Hợi'
                           );
                             
        public $tietkhi = array( 
                                    '1'=>'lập xuân',
                                    '2'=>'kinh trập',
                                    '3'=>'thanh minh',
                                    '4'=>'lập hạ',
                                    '5'=>'mang chủng',
                                    '6'=>'tiểu thử',
                                    '7'=>'lập thu',
                                    '8'=>'bạch lộ',
                                    '9'=>'hàn lộ',
                                    '10'=>'lập đông',
                                    '11'=>'đại tuyết',
                                    '12'=>'tiểu hàn',
                               ); 
                                                                 
      public $nguhanh = array(
                                '1'=>'Hải trung kim',
                                '2'=>'Lư trung hỏa',
                                '3'=>'Đại lâm mộc',
                                '4'=>'Lộ bàng thổ',
                                '5'=>'Kiếm phong kim',
                                '6'=>'Sơn hạ hỏa',
                                '7'=>'Giản hạ thủy',
                                '8'=>'Thành đầu thổ',
                                '9'=>'Bạch lạp kim',
                                '10'=>'Dương liễu mộc',
                                '11'=>'Tuyền trung thủy',
                                '12'=>'Ôc thượng thổ',
                                '13'=>'Tích lịch hỏa',
                                '14'=>'Tùng bách mộc',
                                '15'=>'Trường lưu thủy',
                                '16'=>'Sa trung kim',
                                '17'=>'Sơn hạ hỏa',
                                '18'=>'Bình địa mộc',
                                '19'=>'Bích thượng thổ',
                                '20'=>'Kim bạch kim',
                                '21'=>'Phúc đăng hỏa',
                                '22'=>'Thiên hà thủy',
                                '23'=>'Đại dịch thổ',
                                '24'=>'Thoa xuyến kim',
                                '25'=>'Tang đố mộc',
                                '26'=>'Đại khê thủy',
                                '27'=>'Sa trung thổ',
                                '28'=>'Thiên thượng hỏa',
                                '29'=>'Thạch lưu mộc',
                                '30'=>'Đại hải thủy',
                             );  
                             
     public $cattinhnhatthan_thangam_canngay = array(
                                                        '1'=>'nguyệt đức',
                                                        '2'=>'nguyệt đức hợp',
                                                        '3'=>'thiên quý',
                                                        '4'=>'thiên phúc',
                                                        '5'=>'nguyệt ân',
                                                        '6'=>'nguyệt không',
                                                    ); 
                                                       
     public $cattinhnhatthan_thangam_chingay = array(
                                                        '1'=>'thiên hỷ',
                                                        '2'=>'thiên phú',
                                                        '3'=>'sinh khí',
                                                        '4'=>'thiên thành',
                                                        '5'=>'thiên quan',
                                                        '6'=>'thiên mã',
                                                        '7'=>'thiên tài',
                                                        '8'=>'địa tài',
                                                        '9'=>'nguyệt tài',
                                                        '10'=>'minh tinh',
                                                        '11'=>'thánh tâm',
                                                        '12'=>'ngũ phúc',
                                                        '13'=>'lộc khố',
                                                        '14'=>'phúc sinh',
                                                        '15'=>'cát khánh',
                                                        '16'=>'âm đức',
                                                        '17'=>'u vi tinh',
                                                        '18'=>'mẫn đức tinh',
                                                        '19'=>'kính tâm',
                                                        '20'=>'tuế hợp',
                                                        '21'=>'thiên giải',
                                                        '22'=>'quan nhật',
                                                        '23'=>'hoạt diệu',
                                                        '24'=>'giải thần',
                                                        '25'=>'phổ hộ',
                                                        '26'=>'ích hậu',
                                                        '27'=>'tục thế',
                                                        '28'=>'yếu yên',
                                                        '29'=>'dịch mã',
                                                        '30'=>'tam hợp',
                                                        '31'=>'lục hợp',
                                                        '32'=>'mẫu thương',
                                                        '33'=>'phúc hậu',
                                                        '34'=>'đại hồng sa',
                                                        '35'=>'dân thời nhật đức',
                                                        '36'=>'hoàng ân',
                                                        '37'=>'thanh long',
                                                        '38'=>'minh đường',
                                                        '39'=>'kim đường',
                                                        '40'=>'ngọc đường',
                                                    ); 
                                                     
     public $cattinhnhatthan_thangam_canngay_chingay = array(
                                                                '1'=>'thiên đức',
                                                                '2'=>'thiên đức hợp',
                                                                '3'=>'thiên xá',
                                                            );  
     
     public $ngayhoangdao = array( 
                                        '1'=> 'thanh long hoàng đạo',
                                        '2'=> 'minh đường hoàng đạo',
                                        '3'=> 'thiên hình hắc đạo',
                                        '4'=> 'chu tước hắc đạo',
                                        '5'=> 'kim quỹ hoàng đạo',
                                        '6'=> 'kim đường hoàng đạo',
                                        '7'=> 'bạch hổ hắc đạo',
                                        '8'=> 'ngọc đường hoàng đạo',
                                        '9'=> 'thiên lao hắc đạo',
                                        '10'=>'nguyên vu hắc đạo',
                                        '11'=>'tư mệnh hoàng đạo',
                                        '12'=>'câu trần hắc đạo',
                                 );             
                                                                           
     public $saohungtinh_thangam_canngay = array(
                                                   '1'=>'trùng tang',
                                                   '2'=>'trùng phục',
                                                );   
     
     public $saohungtinh_thangam_chingay = array(
                                                    '1'=>'thiên cương',
                                                    '2'=>'thiên lại',
                                                    '3'=>'thiên ngục',
                                                    '4'=>'tiểu hồng sa',
                                                    '5'=>'đại hao',
                                                    '6'=>'tiểu hao',
                                                    '7'=>'nguyệt phá',
                                                    '8'=>'kiếp sát',
                                                    '9'=>'địa phá',
                                                    '10'=>'thổ phù',
                                                    '11'=>'thổ ôn',
                                                    '12'=>'thiên ôn',
                                                    '13'=>'thọ tử',
                                                    '14'=>'hoang vu',
                                                    '15'=>'thiên tặc',
                                                    '16'=>'địa tặc',
                                                    '17'=>'hỏa tai',
                                                    '18'=>'nguyệt hỏa, độc hỏa',
                                                    '19'=>'nguyệt yếm đại họa',
                                                    '20'=>'nguyệt hư (nguyệt sát)',
                                                    '21'=>'hoàng sa',
                                                    '22'=>'lục bất thành',
                                                    '23'=>'nhân cách',
                                                    '24'=>'thần cách',
                                                    '25'=>'phi ma sát (tai sát)',
                                                    '26'=>'ngũ quỷ',
                                                    '27'=>'băng tiêu ngọa hãm',
                                                    '28'=>'hà khôi (cấu giảo)',
                                                    '29'=>'vãng vong (thổ kỵ)',
                                                    '30'=>'cửu không',
                                                    '31'=>'chu tước',
                                                    '32'=>'bạch hổ',
                                                    '33'=>'huyền vũ',
                                                    '34'=>'câu trần',
                                                    '35'=>'lôi công',
                                                    '36'=>'cô thần',
                                                    '37'=>'quả tú',
                                                    '38'=>'sát chủ',
                                                    '39'=>'nguyệt hình',
                                                    '40'=>'tội chỉ',
                                                    '41'=>'nguyệt kiến chuyên sát',
                                                    '42'=>'lỗ ban sát',
                                                    '43'=>'phủ đầu dát',
                                                    '44'=>'tam tang',
                                                    '45'=>'ngũ hư',
                                                    '46'=>'thổ cầm',
                                                    '47'=>'ly sàng',
                                                    '48'=>'tứ thời cô quả',
                                                    '49'=>'không phòng',
                                                    '50'=>'quỷ khốc',
                                                );
                                                
    public $saohungtinh_thangam_canngay_chingay = array(
                                                            '1'=>'Thiên địa chính chuyển',
                                                            '2'=>'Thiên địa chuyển sát',
                                                            '3'=>'Tứ thời đại mộ',
                                                            '4'=>'Âm thác',
                                                            '5'=>'Dương thác',
     
                                                       );   
    
    
    public $phuongvi  = array(
                                '1'=>'bắc',
                                '2'=>'nam',
                                '3'=>'tây',
                                '4'=>'đông',
                                '5'=>'tây bắc',
                                '6'=>'đông bắc',
                                '7'=>'tây nam',
                                '8'=>'đông nam',
                             );  
                                 
                                 
    public $giohoangdao = array(
                                    '1'=>'Tí (23:00-0:59)',
                                    '2'=>'Sửu (1:00-2:59)',
                                    '3'=>'Dần (3:00-4:59)',
                                    '4'=>'Mão (5:00-6:59)',
                                    '5'=>'Thìn (7:00-8:59)',
                                    '6'=>'Tỵ (9:00-10:59)',
                                    '7'=>'Ngọ (11:00-12:59)',
                                    '8'=>'Mùi (13:00-14:59)',
                                    '9'=>'Thân (15:00-16:59)',
                                    '10'=>'Dậu (17:00-18:59)',
                                    '11'=>'Tuất (19:00-20:59)',
                                    '12'=>'Hợi (21:00-22:59)',
                               );
    
    public $xd_nguhanh = array(
                                    '1,1'=>'1',
                                    '2,2'=>'1',
                                    '3,3'=>'2',
                                    '4,4'=>'2',
                                    '5,5'=>'3',
                                    '6,6'=>'3',
                                    '7,7'=>'4',
                                    '8,8'=>'4',
                                    '9,9'=>'5',
                                    '10,10'=>'5',
                                    '1,11'=>'6',
                                    '2,12'=>'6',
                                    '3,1'=>'7',
                                    '4,2'=>'7',
                                    '5,3'=>'8',
                                    '6,4'=>'8',
                                    '7,5'=>'9',
                                    '8,6'=>'9',
                                    '9,7'=>'10',
                                    '10,8'=>'10',
                                    '1,9'=>'11',
                                    '2,10'=>'11',
                                    '3,11'=>'12',
                                    '4,12'=>'12',
                                    '5,1'=>'13',
                                    '6,2'=>'13',
                                    '7,3'=>'14',
                                    '8,4'=>'14',
                                    '9,5'=>'15',
                                    '10,6'=>'15',
                                    '1,7'=>'16',
                                    '2,8'=>'16',
                                    '3,9'=>'17',
                                    '4,10'=>'17',
                                    '5,11'=>'18',
                                    '6,12'=>'18',
                                    '7,1'=>'19',
                                    '8,2'=>'19',
                                    '9,3'=>'20',
                                    '10,4'=>'20',
                                    '1,5'=>'21',
                                    '2,6'=>'21',
                                    '3,7'=>'22',
                                    '4,8'=>'22',
                                    '5,9'=>'23',
                                    '6,10'=>'23',
                                    '7,11'=>'24',
                                    '8,12'=>'24',
                                    '9,1'=>'25',
                                    '10,2'=>'25',
                                    '1,3'=>'26',
                                    '2,4'=>'26',
                                    '3,5'=>'27',
                                    '4,6'=>'27',
                                    '5,7'=>'28',
                                    '6,8'=>'28',
                                    '7,9'=>'29',
                                    '8,10'=>'29',
                                    '9,11'=>'30',
                                    '10,12'=>'30',
                              );   
     
     public $xd_cattinhnhatthan_thangam_canngay = array(
                                                            '1,3'=>'1',
                                                            '1,8'=>'2',
                                                            '1,1'=>'3',
                                                            '1,2'=>'3',
                                                            '1,6'=>'4',
                                                            '1,3'=>'5',
                                                            '1,9'=>'6',
                                                            '2,1'=>'1',
                                                            '2,6'=>'2',
                                                            '2,1'=>'3',
                                                            '2,2'=>'3',
                                                            '2,5'=>'4',
                                                            '2,4'=>'5',
                                                            '2,7'=>'6',
                                                            '3,9'=>'1',
                                                            '3,4'=>'2',
                                                            '3,1'=>'3',
                                                            '3,2'=>'3',
                                                            '3,0'=>'4',
                                                            '3,7'=>'5',
                                                            '3,3'=>'6',
                                                            '4,7'=>'1',
                                                            '4,2'=>'2',
                                                            '4,3'=>'3',
                                                            '4,4'=>'3',
                                                            '4,8'=>'4',
                                                            '4,10'=>'4',
                                                            '4,6'=>'5',
                                                            '4,1'=>'6',
                                                            '5,3'=>'1',
                                                            '5,8'=>'2',
                                                            '5,3'=>'3',
                                                            '5,4'=>'3',
                                                            '5,8'=>'4',
                                                            '5,9'=>'4',
                                                            '5,5'=>'5',
                                                            '5,9'=>'6',
                                                            '6,1'=>'1',
                                                            '6,6'=>'2',
                                                            '6,3'=>'3',
                                                            '6,4'=>'3',
                                                            '6,0'=>'4',
                                                            '6,8'=>'5',
                                                            '6,7'=>'6',
                                                            '7,9'=>'1',
                                                            '7,4'=>'2',
                                                            '7,7'=>'3',
                                                            '7,8'=>'3',
                                                            '7,2'=>'4',
                                                            '7,9'=>'5',
                                                            '7,3'=>'6',
                                                            '8,9'=>'1',
                                                            '8,4'=>'2',
                                                            '8,7'=>'3',
                                                            '8,8'=>'3',
                                                            '8,1'=>'4',
                                                            '8,10'=>'5',
                                                            '8,1'=>'6',
                                                            '9,3'=>'1',
                                                            '9,8'=>'2',
                                                            '9,7'=>'3',
                                                            '9,8'=>'3',
                                                            '9,0'=>'4',
                                                            '9,7'=>'5',
                                                            '9,9'=>'6',
                                                            '10,1'=>'1',
                                                            '10,6'=>'2',
                                                            '10,9'=>'3',
                                                            '10,10'=>'3',
                                                            '10,4'=>'4',
                                                            '10,2'=>'5',
                                                            '10,7'=>'6',
                                                            '11,9'=>'1',
                                                            '11,4'=>'2',
                                                            '11,9'=>'3',
                                                            '11,10'=>'3',
                                                            '11,3'=>'4',
                                                            '11,1'=>'5',
                                                            '11,3'=>'6',
                                                            '12,7'=>'1',
                                                            '12,2'=>'2',
                                                            '12,9'=>'3',
                                                            '12,10'=>'3',
                                                            '12,0'=>'4',
                                                            '12,8'=>'5',
                                                            '12,1'=>'6',
                                                       );   
                                                                                                                                                                                                                                                                                
     public $xd_cattinhnhatthan_thangam_chingay = array(
                                                               '1,1'=>'3,26,32,34,37',
                                                                '1,2'=>'27,34,38',
                                                                '1,3'=>'18,28,33',
                                                                '1,4'=>'0',
                                                                '1,5'=>'2,7,13,',
                                                                '1,6'=>'8,23,39',
                                                                '1,7'=>'6,9,30,35',
                                                                '1,8'=>'4,19,40',
                                                                '1,9'=>'10,21,24,25,29',
                                                                '1,10'=>'14,15,16,',
                                                                '1,11'=>'1,5,30,36',
                                                                '1,12'=>'11,12,17,31,32',
                                                                '2,1'=>'5,20,32,34',
                                                                '2,2'=>'3,19,34,36',
                                                                '2,3'=>'12,15,25,33,37',
                                                                '2,4'=>'14,22,38',
                                                                '2,5'=>'17',
                                                                '2,6'=>'2,9,11,13,29',
                                                                '2,7'=>'7,26,35',
                                                                '2,8'=>'8,16,18,27,30,39',
                                                                '2,9'=>'6,21,24,28',
                                                                '2,10'=>'4,40',
                                                                '2,11'=>'10,23,31',
                                                                '2,12'=>'1,30,32',
                                                                '3,1'=>'1,11,30,32,34',
                                                                '3,2'=>'17,26,34',
                                                                '3,3'=>'3,5,27,29,33,36',
                                                                '3,4'=>'28',
                                                                '3,5'=>'18,37',
                                                                '3,6'=>'9,12,16,38',
                                                                '3,7'=>'2,13,35',
                                                                '3,8'=>'23',
                                                                '3,9'=>'7,19,30',
                                                                '3,10'=>'8,21,25,31,39',
                                                                '3,11'=>'6,14,24',
                                                                '3,12'=>'4,15,20,32,40',
                                                                '4,1'=>'6,23',
                                                                '4,2'=>'1,4,30,40',
                                                                '4,3'=>'10,19,32',
                                                                '4,4'=>'3,16,25,32',
                                                                '4,5'=>'5,14,15,34',
                                                                '4,6'=>'33,34,36',
                                                                '4,7'=>'11,17,37',
                                                                '4,8'=>'2,9,13,26,38',
                                                                '4,9'=>'12,27,31',
                                                                '4,10'=>'18,21,28,30,35',
                                                                '4,11'=>'7,20,24',
                                                                '4,12'=>'8,29,39',
                                                                '5,1'=>'7,24',
                                                                '5,2'=>'8,11,16,39',
                                                                '5,3'=>'1,6,26,30,32',
                                                                '5,4'=>'4,17,27,32,40',
                                                                '5,5'=>'3,10,28,34',
                                                                '5,6'=>'33,34',
                                                                '5,7'=>'5,18,22',
                                                                '5,8'=>'31',
                                                                '5,9'=>'2,13,29,37',
                                                                '5,10'=>'9,19,20,23,35,36,38',
                                                                '5,11'=>'21,25,30',
                                                                '5,12'=>'12,14',
                                                                '6,1'=>'24',
                                                                '6,2'=>'0',
                                                                '6,3'=>'7,12,23,32',
                                                                '6,4'=>'1,8,19,30,32,36,39',
                                                                '6,5'=>'6,25,34',
                                                                '6,6'=>'3,4,14,29,33,34,40',
                                                                '6,7'=>'10,15,31',
                                                                '6,8'=>'11',
                                                                '6,9'=>'5,17,20,26',
                                                                '6,10'=>'2,13,27,35',
                                                                '6,11'=>'21,28,37',
                                                                '6,12'=>'9,18,30,38',
                                                                '7,1'=>'14,30,35,36,37',
                                                                '7,2'=>'32,38',
                                                                '7,3'=>'11,24,29',
                                                                '7,4'=>'15,26',
                                                                '7,5'=>'1,7,27,30,32',
                                                                '7,6'=>'8,12,17,28,31,39',
                                                                '7,7'=>'3,6,9,34',
                                                                '7,8'=>'4,20,34,40',
                                                                '7,9'=>'10,18,33',
                                                                '7,10'=>'11,16',
                                                                '7,11'=>'2,5,13,19',
                                                                '7,12'=>'21,23,25',
                                                                '8,1'=>'5,35',
                                                                '8,2'=>'18,30,32',
                                                                '8,3'=>'24,37',
                                                                '8,4'=>'38',
                                                                '8,5'=>'19,23,31,32',
                                                                '8,6'=>'1,9,25,30',
                                                                '8,7'=>'7,14,20,34,36',
                                                                '8,8'=>'3,8,16,34,39',
                                                                '8,9'=>'6,11,12,15,33',
                                                                '8,10'=>'4,22,26,40',
                                                                '8,11'=>'10,17,27',
                                                                '8,12'=>'2,13,21,28,29',
                                                                '9,1'=>'2,10,13,25,35',
                                                                '9,2'=>'14,23,32',
                                                                '9,3'=>'5,30',
                                                                '9,4'=>'11,31',
                                                                '9,5'=>'24,26,32,37',
                                                                '9,6'=>'9,15,16,20,27,38',
                                                                '9,7'=>'1,21,28,30,34',
                                                                '9,8'=>'17,34',
                                                                '9,9'=>'3,7,29,33',
                                                                '9,10'=>'8,39',
                                                                '9,11'=>'6,18',
                                                                '9,12'=>'4,12,19,36,40',
                                                                '10,1'=>'6,17,28',
                                                                '10,2'=>'2,4,13,40',
                                                                '10,3'=>'10,12,31',
                                                                '10,4'=>'16,18,30,35',
                                                                '10,5'=>'5,20,24,36',
                                                                '10,6'=>'19,29',
                                                                '10,7'=>'21,23,25,37',
                                                                '10,8'=>'1,9,14,30,38',
                                                                '10,9'=>'32,34',
                                                                '10,10'=>'3,11,32',
                                                                '10,11'=>'7,15,26,34',
                                                                '10,12'=>'8,27,33,39',
                                                                '11,1'=>'7,18,19,22',
                                                                '11,2'=>'8,16,25,31,39',
                                                                '11,3'=>'2,6,13,14,29',
                                                                '11,4'=>'4,20,23,35,40',
                                                                '11,5'=>'10,11,30',
                                                                '11,6'=>'12,26',
                                                                '11,7'=>'5,24,27',
                                                                '11,8'=>'15,21,28',
                                                                '11,9'=>'1,30,32,34,36,37',
                                                                '11,10'=>'9,17,32,38',
                                                                '11,11'=>'3,34',
                                                                '11,12'=>'33',
                                                                '12,1'=>'15,27,31',
                                                                '12,2'=>'28',
                                                                '12,3'=>'7,17,20',
                                                                '12,4'=>'2,8,13,35,39',
                                                                '12,5'=>'6',
                                                                '12,6'=>'4,18,30,40',
                                                                '12,7'=>'10,19,24',
                                                                '12,8'=>'21,25,36',
                                                                '12,9'=>'5,12,14,23,32,34',
                                                                '12,10'=>'1,30,32',
                                                                '12,11'=>'11,34,37',
                                                                '12,12'=>'3,9,16,26,29,33,38',
                                                       );
    
     public $xd_cattinhnhatthandacbiet_thangam_canngay = array(
                                                                    '1,4'=>'1',
                                                                    '3,9'=>'1',
                                                                    '4,8'=>'1',
                                                                    '6,1'=>'1',
                                                                    '7,10'=>'1',
                                                                    '9,3'=>'1',
                                                                    '10,2'=>'1',
                                                                    '12,7'=>'1',
                                                                    '1,9'=>'2',
                                                                    '3,4'=>'2',
                                                                    '4,3'=>'2',
                                                                    '6,6'=>'2',
                                                                    '7,5'=>'2',
                                                                    '9,8'=>'2',
                                                                    '10,7'=>'2',
                                                                    '12,2'=>'2',
                                                               );
                                                               
     public $xd_cattinhnhatthandacbiet_thangam_chingay = array(
                                                                    '2,9'=>'1',
                                                                    '5,12'=>'1',
                                                                    '8,3'=>'1',
                                                                    '11,6'=>'1',
                                                                    '2,1'=>'2',
                                                                    '5,3'=>'2',
                                                                    '8,12'=>'2',
                                                                    '11,9'=>'2',
                                                               );
                                                               
     public $xd_cattinhnhatthandacbiet_thangam_canngay_chingay = array(
                                                                        '1,5,3'=>'3',
                                                                        '2,5,3'=>'3',
                                                                        '3,5,3'=>'3',
                                                                        '4,1,7'=>'3',
                                                                        '6,1,7'=>'3',
                                                                        '7,5,9'=>'3',
                                                                        '8,5,9'=>'3',
                                                                        '9,5,9'=>'3',
                                                                        '10,1,1'=>'3',
                                                                        '12,1,1'=>'3',
                                                               );
                                                               
    
    public $xd_ngayhoangdao = array(
                                        '1,1'=>'1',
                                        '1,2'=>'2',
                                        '1,3'=>'3',
                                        '1,4'=>'4',
                                        '1,5'=>'5',
                                        '1,6'=>'6',
                                        '1,7'=>'7',
                                        '1,8'=>'8',
                                        '1,9'=>'9',
                                        '1,10'=>'10',
                                        '1,11'=>'11',
                                        '1,12'=>'12',
                                        '2,1'=>'11',
                                        '2,2'=>'12',
                                        '2,3'=>'1',
                                        '2,4'=>'2',
                                        '2,5'=>'3',
                                        '2,6'=>'4',
                                        '2,7'=>'5',
                                        '2,8'=>'6',
                                        '2,9'=>'7',
                                        '2,10'=>'8',
                                        '2,11'=>'9',
                                        '2,12'=>'10',
                                        '3,1'=>'9',
                                        '3,2'=>'10',
                                        '3,3'=>'11',
                                        '3,4'=>'12',
                                        '3,5'=>'1',
                                        '3,6'=>'2',
                                        '3,7'=>'3',
                                        '3,8'=>'4',
                                        '3,9'=>'5',
                                        '3,10'=>'6',
                                        '3,11'=>'7',
                                        '3,12'=>'8',
                                        '4,1'=>'7',
                                        '4,2'=>'8',
                                        '4,3'=>'9',
                                        '4,4'=>'10',
                                        '4,5'=>'11',
                                        '4,6'=>'12',
                                        '4,7'=>'1',
                                        '4,8'=>'2',
                                        '4,9'=>'3',
                                        '4,10'=>'4',
                                        '4,11'=>'5',
                                        '4,12'=>'6',
                                        '5,1'=>'5',
                                        '5,2'=>'6',
                                        '5,3'=>'7',
                                        '5,4'=>'8',
                                        '5,5'=>'9',
                                        '5,6'=>'10',
                                        '5,7'=>'11',
                                        '5,8'=>'12',
                                        '5,9'=>'1',
                                        '5,10'=>'2',
                                        '5,11'=>'3',
                                        '5,12'=>'4',
                                        '6,1'=>'3',
                                        '6,2'=>'4',
                                        '6,3'=>'5',
                                        '6,4'=>'6',
                                        '6,5'=>'7',
                                        '6,6'=>'8',
                                        '6,7'=>'9',
                                        '6,8'=>'10',
                                        '6,9'=>'11',
                                        '6,10'=>'12',
                                        '6,11'=>'1',
                                        '6,12'=>'2',
                                        '7,1'=>'1',
                                        '7,2'=>'2',
                                        '7,3'=>'3',
                                        '7,4'=>'4',
                                        '7,5'=>'5',
                                        '7,6'=>'6',
                                        '7,7'=>'7',
                                        '7,8'=>'8',
                                        '7,9'=>'9',
                                        '7,10'=>'10',
                                        '7,11'=>'11',
                                        '7,12'=>'12',
                                        '8,1'=>'11',
                                        '8,2'=>'12',
                                        '8,3'=>'1',
                                        '8,4'=>'2',
                                        '8,5'=>'3',
                                        '8,6'=>'4',
                                        '8,7'=>'5',
                                        '8,8'=>'6',
                                        '8,9'=>'7',
                                        '8,10'=>'8',
                                        '8,11'=>'9',
                                        '8,12'=>'10',
                                        '9,1'=>'9',
                                        '9,2'=>'10',
                                        '9,3'=>'11',
                                        '9,4'=>'12',
                                        '9,5'=>'1',
                                        '9,6'=>'2',
                                        '9,7'=>'3',
                                        '9,8'=>'4',
                                        '9,9'=>'5',
                                        '9,10'=>'6',
                                        '9,11'=>'7',
                                        '9,12'=>'8',
                                        '10,1'=>'7',
                                        '10,2'=>'8',
                                        '10,3'=>'9',
                                        '10,4'=>'10',
                                        '10,5'=>'11',
                                        '10,6'=>'12',
                                        '10,7'=>'1',
                                        '10,8'=>'2',
                                        '10,9'=>'3',
                                        '10,10'=>'4',
                                        '10,11'=>'5',
                                        '10,12'=>'6',
                                        '11,1'=>'5',
                                        '11,2'=>'6',
                                        '11,3'=>'7',
                                        '11,4'=>'8',
                                        '11,5'=>'9',
                                        '11,6'=>'10',
                                        '11,7'=>'11',
                                        '11,8'=>'12',
                                        '11,9'=>'1',
                                        '11,10'=>'2',
                                        '11,11'=>'3',
                                        '11,12'=>'4',
                                        '12,1'=>'3',
                                        '12,2'=>'4',
                                        '12,3'=>'5',
                                        '12,4'=>'6',
                                        '12,5'=>'7',
                                        '12,6'=>'8',
                                        '12,7'=>'9',
                                        '12,8'=>'10',
                                        '12,9'=>'11',
                                        '12,10'=>'12',
                                        '12,11'=>'1',
                                        '12,12'=>'2',
                                   );
    
    public $xd_saohungtinh_thangam_canngay = array(
                                                        '1,1'=>'1',
                                                        '2,2'=>'1',
                                                        '3,6'=>'1',
                                                        '4,3'=>'1',
                                                        '5,4'=>'1',
                                                        '6,6'=>'1',
                                                        '7,7'=>'1',
                                                        '8,8'=>'1',
                                                        '9,6'=>'1',
                                                        '10,9'=>'1',
                                                        '11,10'=>'1',
                                                        '12,6'=>'1',
                                                        '1,7'=>'2',
                                                        '2,8'=>'2',
                                                        '3,6'=>'2',
                                                        '4,9'=>'2',
                                                        '5,10'=>'2',
                                                        '6,5'=>'2',
                                                        '7,1'=>'2',
                                                        '8,2'=>'2',
                                                        '9,6'=>'2',
                                                        '10,9'=>'2',
                                                        '11,10'=>'2',
                                                        '12,6'=>'2',  
                                                  );
                                                  
    public $xd_saohungtinh_thangam_chingay = array(
                                                       '1,1'=>'3,25,42',
                                                        '1,2'=>'14,16,17,20,48',
                                                        '1,3'=>'10,22,29,35',
                                                        '1,4'=>'31,41',
                                                        '1,5'=>'11,15,30,37,43,44,49',
                                                        '1,6'=>'1,4,6,14,18,24,27,38,39,45',
                                                        '1,7'=>'5,21,26,32,40',
                                                        '1,8'=>'12',
                                                        '1,9'=>'7',
                                                        '1,10'=>'2,14,23,33,47',
                                                        '1,11'=>'13,19,36,50',
                                                        '1,12'=>'8,9,28,34,46',
                                                        '2,1'=>'1,9,16,27,38,39,40,42',
                                                        '2,2'=>'14,30,41,48',
                                                        '2,3'=>'21,26',
                                                        '2,4'=>'3,10,24',
                                                        '2,5'=>'2,13,18,25,43,44',
                                                        '2,6'=>'11,14,29,31,34,37,49',
                                                        '2,7'=>'6,23,28',
                                                        '2,8'=>'5,17,23',
                                                        '2,9'=>'8,32',
                                                        '2,10'=>'4,7,14,15,19,45,47',
                                                        '2,11'=>'12,20,50',
                                                        '2,12'=>'33,35,36,46',
                                                        '3,1'=>'21,36,42,49',
                                                        '3,2'=>'4,9,14,24,27,28,45,48',
                                                        '3,3'=>'15,17',
                                                        '3,4'=>'2,18,34,41',
                                                        '3,5'=>'10,12,25,39,43,44',
                                                        '3,6'=>'14,23,33,35',
                                                        '3,7'=>'3,11,25,37',
                                                        '3,8'=>'1,6,20,31,38,40',
                                                        '3,9'=>'5,8,19,29',
                                                        '3,10'=>'14,47',
                                                        '3,11'=>'7,22,30,32',
                                                        '3,12'=>'13,16,46,50',
                                                        '4,1'=>'2,14,32',
                                                        '4,2'=>'34,36,40',
                                                        '4,3'=>'1,8,9,12,18,27,33,46,47',
                                                        '4,4'=>'23,25,38,42',
                                                        '4,5'=>'14,20,48',
                                                        '4,6'=>'4,10,13,22',
                                                        '4,7'=>'21,41,47',
                                                        '4,8'=>'11,15,19,30,37,43,44',
                                                        '4,9'=>'6,14,17,28,35,39,45',
                                                        '4,10'=>'3,5,26,31',
                                                        '4,11'=>'16,49,50',
                                                        '4,12'=>'7,24,29',
                                                        '5,1'=>'3,7,13,14,15,25,45',
                                                        '5,2'=>'18,20,23,33',
                                                        '5,3'=>'21,32,35,36,46,47',
                                                        '5,4'=>'9,17,26,27,28,29,30,42',
                                                        '5,5'=>'14,48',
                                                        '5,7'=>'10,12,19,39,41,47',
                                                        '5,8'=>'34,43,44',
                                                        '5,9'=>'11,14,37,38,40',
                                                        '5,10'=>'1,2,4,6,16,22,24',
                                                        '5,11'=>'5,50',
                                                        '5,12'=>'8,31,49',
                                                        '6,1'=>'12,14,18,21,30',
                                                        '6,2'=>'4,7,22,31,39',
                                                        '6,3'=>'40,46,47',
                                                        '6,4'=>'3,36,42',
                                                        '6,5'=>'1,9,14,32,45,48',
                                                        '6,6'=>'15,19',
                                                        '6,7'=>'2,13,29,41,47',
                                                        '6,8'=>'10,24,33,43,44,49',
                                                        '6,9'=>'8,14,16,26',
                                                        '6,10'=>'11,17,25,34,37',
                                                        '6,11'=>'6,20,27,28,38,50',
                                                        '6,12'=>'5,23,35',
                                                        '7,1'=>'5',
                                                        '7,2'=>'13,26,38',
                                                        '7,3'=>'7,39,49',
                                                        '7,4'=>'2,14,31',
                                                        '7,5'=>'17,19,36',
                                                        '7,6'=>'4,8,9,16,24,28,35,46',
                                                        '7,7'=>'3,21,25,32,42',
                                                        '7,8'=>'14,20,48',
                                                        '7,9'=>'10',
                                                        '7,10'=>'12,23,29,30,33,40,41,43',
                                                        '7,11'=>'11,15,37,44,47,50',
                                                        '7,12'=>'1,6,14,18,34,45',
                                                        '8,1'=>'2,6,22,28,29',
                                                        '8,2'=>'5',
                                                        '8,3'=>'8,21',
                                                        '8,4'=>'7,14,15,19,24,25,40,45,49',
                                                        '8,5'=>'20',
                                                        '8,6'=>'26,31,34,36,46',
                                                        '8,7'=>'1,9,16,27,30,42',
                                                        '8,8'=>'13,14,23,48',
                                                        '8,9'=>'12,32,35',
                                                        '8,10'=>'3,4,10,39,41,43',
                                                        '8,11'=>'17,18,44,47,50',
                                                        '8,12'=>'11,14,33,37,38',
                                                        '9,1'=>'3,21,25,26,37',
                                                        '9,2'=>'1,4,6,11,15,20,24',
                                                        '9,3'=>'5,14,19,30,35',
                                                        '9,4'=>'34',
                                                        '9,5'=>'22,29',
                                                        '9,6'=>'7,33,46',
                                                        '9,7'=>'14,36,38,42,49',
                                                        '9,8'=>'27,28,31,39,48',
                                                        '9,9'=>'8,9,13,18',
                                                        '9,10'=>'2,41,43',
                                                        '9,11'=>'14,32,40,44,47,50',
                                                        '9,12'=>'10,12,17',
                                                        '10,1'=>'32,41,43',
                                                        '10,2'=>'11,15,19,34,37,44',
                                                        '10,3'=>'6,14,28,45',
                                                        '10,4'=>'3,5,23,33',
                                                        '10,5'=>'16,40',
                                                        '10,6'=>'4,7,47',
                                                        '10,7'=>'2,14,21',
                                                        '10,8'=>'38,29',
                                                        '10,9'=>'46,49',
                                                        '10,10'=>'1,8,9,18,25,31,38,42',
                                                        '10,11'=>'14,20,50',
                                                        '10,12'=>'10,17,22,24,26,30',
                                                        '11,1'=>'10,12,19,41,43',
                                                        '11,2'=>'23,33,44',
                                                        '11,3'=>'11,14,21,32,37,38',
                                                        '11,4'=>'1,2,6,13,16,22,39',
                                                        '11,5'=>'5',
                                                        '11,6'=>'8,35',
                                                        '11,7'=>'3,7,14,15,17,25,45',
                                                        '11,8'=>'18,20,26,34',
                                                        '11,9'=>'30,36,46',
                                                        '11,10'=>'4,9,24,27,28,42,49',
                                                        '11,11'=>'14,29,48,50',
                                                        '11,12'=>'31,40',
                                                        '12,1'=>'2,17,21,41,43',
                                                        '12,2'=>'4,10,29,31,44,49',
                                                        '12,3'=>'8,14,16',
                                                        '12,4'=>'11,12,25,37',
                                                        '12,5'=>'6,20,27,28,32,38',
                                                        '12,6'=>'5,30,40,47',
                                                        '12,7'=>'14,18',
                                                        '12,8'=>'7,22,24,33',
                                                        '12,9'=>'35,46',
                                                        '12,10'=>'3,13,34,36,42',
                                                        '12,11'=>'1,9,14,26,39,45,48,50',
                                                        '12,12'=>'15,19,23',
                                                  );
                                                  
    public $xd_saohungtinh_thangam_canngay_chingay = array(
                                                                '1,10,4'=>'1',
                                                                '1,2,4'=>'2',
                                                                '1,2,8'=>'3',
                                                                '1,7,11'=>'4',
                                                                '1,1,3'=>'5',
                                                                '2,10,4'=>'1',
                                                                '2,2,4'=>'2',
                                                                '2,2,8'=>'3',
                                                                '2,8,10'=>'4',
                                                                '2,2,4'=>'5',
                                                                '3,10,4'=>'1',
                                                                '3,2,4'=>'2',
                                                                '3,2,8'=>'3',
                                                                '3,9,10'=>'4',
                                                                '3,1,5'=>'5',
                                                                '4,3,7'=>'1',
                                                                '4,3,7'=>'2',
                                                                '4,3,11'=>'3',
                                                                '4,4,8'=>'4',
                                                                '4,4,6'=>'5',
                                                                '5,3,7'=>'1',
                                                                '5,3,7'=>'2',
                                                                '5,3,11'=>'3',
                                                                '5,3,7'=>'4',
                                                                '5,3,7'=>'5',
                                                                '6,3,7'=>'1',
                                                                '6,3,7'=>'2',
                                                                '6,3,11'=>'3',
                                                                '6,4,6'=>'4',
                                                                '6,4,8'=>'5',
                                                                '7,4,10'=>'1',
                                                                '7,8,10'=>'2',
                                                                '7,8,2'=>'3',
                                                                '7,1,5'=>'4',
                                                                '7,8,9'=>'5',
                                                                '8,4,10'=>'1',
                                                                '8,8,10'=>'2',
                                                                '8,8,2'=>'3',
                                                                '8,2,4'=>'4',
                                                                '8,8,10'=>'5',
                                                                '9,4,10'=>'1',
                                                                '9,8,10'=>'2',
                                                                '9,8,2'=>'3',
                                                                '9,1,3'=>'4',
                                                                '9,8,11'=>'5',
                                                                '10,7,1'=>'1',
                                                                '10,9,1'=>'2',
                                                                '10,9,5'=>'3',
                                                                '10,10,2'=>'4',
                                                                '10,10,12'=>'5',
                                                                '11,7,1'=>'1',
                                                                '11,9,1'=>'2',
                                                                '11,9,5'=>'3',
                                                                '11,9,1'=>'4',
                                                                '11,9,1'=>'5',
                                                                '12,7,1'=>'1',
                                                                '12,9,1'=>'2',
                                                                '12,9,5'=>'3',
                                                                '12,10,12'=>'4',
                                                                '12,10,2'=>'5',
                                                          );
    public $xd_trucngay = array(
                                    '1,3'=>'1',
                                    '1,4'=>'2',
                                    '1,5'=>'3',
                                    '1,6'=>'4',
                                    '1,7'=>'5',
                                    '1,8'=>'6',
                                    '1,9'=>'7',
                                    '1,10'=>'8',
                                    '1,11'=>'9',
                                    '1,12'=>'10',
                                    '1,1'=>'11',
                                    '1,2'=>'12',
                                    '2,4'=>'1',
                                    '2,5'=>'2',
                                    '2,6'=>'3',
                                    '2,7'=>'4',
                                    '2,8'=>'5',
                                    '2,9'=>'6',
                                    '2,10'=>'7',
                                    '2,11'=>'8',
                                    '2,12'=>'9',
                                    '2,1'=>'10',
                                    '2,2'=>'11',
                                    '2,3'=>'12',
                                    '3,5'=>'1',
                                    '3,6'=>'2',
                                    '3,7'=>'3',
                                    '3,8'=>'4',
                                    '3,9'=>'5',
                                    '3,10'=>'6',
                                    '3,11'=>'7',
                                    '3,12'=>'8',
                                    '3,1'=>'9',
                                    '3,2'=>'10',
                                    '3,3'=>'11',
                                    '3,4'=>'12',
                                    '4,6'=>'1',
                                    '4,7'=>'2',
                                    '4,8'=>'3',
                                    '4,9'=>'4',
                                    '4,10'=>'5',
                                    '4,11'=>'6',
                                    '4,12'=>'7',
                                    '4,1'=>'8',
                                    '4,2'=>'9',
                                    '4,3'=>'10',
                                    '4,4'=>'11',
                                    '4,5'=>'12',
                                    '5,7'=>'1',
                                    '5,8'=>'2',
                                    '5,9'=>'3',
                                    '5,10'=>'4',
                                    '5,11'=>'5',
                                    '5,12'=>'6',
                                    '5,1'=>'7',
                                    '5,2'=>'8',
                                    '5,3'=>'9',
                                    '5,4'=>'10',
                                    '5,5'=>'11',
                                    '5,6'=>'12',
                                    '6,8'=>'1',
                                    '6,9'=>'2',
                                    '6,10'=>'3',
                                    '6,11'=>'4',
                                    '6,12'=>'5',
                                    '6,1'=>'6',
                                    '6,2'=>'7',
                                    '6,3'=>'8',
                                    '6,4'=>'9',
                                    '6,5'=>'10',
                                    '6,6'=>'11',
                                    '6,7'=>'12',
                                    '7,9'=>'1',
                                    '7,10'=>'2',
                                    '7,11'=>'3',
                                    '7,12'=>'4',
                                    '7,1'=>'5',
                                    '7,2'=>'6',
                                    '7,3'=>'7',
                                    '7,4'=>'8',
                                    '7,5'=>'9',
                                    '7,6'=>'10',
                                    '7,7'=>'11',
                                    '7,8'=>'12',
                                    '8,10'=>'1',
                                    '8,11'=>'2',
                                    '8,12'=>'3',
                                    '8,1'=>'4',
                                    '8,2'=>'5',
                                    '8,3'=>'6',
                                    '8,4'=>'7',
                                    '8,5'=>'8',
                                    '8,6'=>'9',
                                    '8,7'=>'10',
                                    '8,8'=>'11',
                                    '8,9'=>'12',
                                    '9,11'=>'1',
                                    '9,12'=>'2',
                                    '9,1'=>'3',
                                    '9,2'=>'4',
                                    '9,3'=>'5',
                                    '9,4'=>'6',
                                    '9,5'=>'7',
                                    '9,6'=>'8',
                                    '9,7'=>'9',
                                    '9,8'=>'10',
                                    '9,9'=>'11',
                                    '9,10'=>'12',
                                    '10,12'=>'1',
                                    '10,1'=>'2',
                                    '10,2'=>'3',
                                    '10,3'=>'4',
                                    '10,4'=>'5',
                                    '10,5'=>'6',
                                    '10,6'=>'7',
                                    '10,7'=>'8',
                                    '10,8'=>'9',
                                    '10,9'=>'10',
                                    '10,10'=>'11',
                                    '10,11'=>'12',
                                    '11,1'=>'1',
                                    '11,2'=>'2',
                                    '11,3'=>'3',
                                    '11,4'=>'4',
                                    '11,5'=>'5',
                                    '11,6'=>'6',
                                    '11,7'=>'7',
                                    '11,8'=>'8',
                                    '11,9'=>'9',
                                    '11,10'=>'10',
                                    '11,11'=>'11',
                                    '11,12'=>'12',
                                    '12,2'=>'1',
                                    '12,3'=>'2',
                                    '12,4'=>'3',
                                    '12,5'=>'4',
                                    '12,6'=>'5',
                                    '12,7'=>'6',
                                    '12,8'=>'7',
                                    '12,9'=>'8',
                                    '12,10'=>'9',
                                    '12,11'=>'10',
                                    '12,12'=>'11',
                                    '12,1'=>'12',
                               );
                               
        public $xd_huong_hythan = array(
                                            '1'=>'6',
                                            '2'=>'5',
                                            '3'=>'7',
                                            '4'=>'2',
                                            '5'=>'8',
                                            '6'=>'6',
                                            '7'=>'5',
                                            '8'=>'7',
                                            '9'=>'2',
                                            '10'=>'8',
                                       );
                                       
        public $xd_huong_taithan = array(
                                            '1'=>'8',
                                            '2'=>'8',
                                            '3'=>'4',
                                            '4'=>'4',
                                            '5'=>'1',
                                            '6'=>'2',
                                            '7'=>'7',
                                            '8'=>'7',
                                            '9'=>'3',
                                            '10'=>'5',
                                        );
       
        public $xd_huong_hacthan = array(
                                            '6,10'=>'6',
                                            '7,11'=>'6',
                                            '8,12'=>'6',
                                            '9,1'=>'6',
                                            '10,2'=>'6',
                                            '1,3'=>'6',
                                            '2,4'=>'4',
                                            '3,5'=>'4',
                                            '4,6'=>'4',
                                            '5,7'=>'4',
                                            '6,8'=>'4',
                                            '7,9'=>'8',
                                            '8,10'=>'8',
                                            '9,11'=>'8',
                                            '10,12'=>'8',
                                            '1,1'=>'8',
                                            '2,2'=>'8',
                                            '3,3'=>'2',
                                            '4,4'=>'2',
                                            '5,5'=>'2',
                                            '6,6'=>'2',
                                            '7,7'=>'2',
                                            '8,8'=>'7',
                                            '9,9'=>'7',
                                            '10,10'=>'7',
                                            '1,11'=>'7',
                                            '2,12'=>'7',
                                            '3,1'=>'7',
                                            '4,2'=>'3',
                                            '5,3'=>'3',
                                            '6,4'=>'3',
                                            '7,5'=>'3',
                                            '8,6'=>'3',
                                            '9,7'=>'5',
                                            '10,8'=>'5',
                                            '1,9'=>'5',
                                            '2,10'=>'5',
                                            '3,11'=>'5',
                                            '4,12'=>'5',
                                            '5,1'=>'1',
                                            '6,2'=>'1',
                                            '7,3'=>'1',
                                            '8,4'=>'1',
                                            '9,5'=>'1',  
                                        );                                                               
        
        public $xd_giohoangdao = array(
                                        '3,1'=>'1',
                                        '3,2'=>'1',
                                        '3,3'=>'2',
                                        '3,4'=>'2',
                                        '3,5'=>'1',
                                        '3,6'=>'1',
                                        '3,7'=>'2',
                                        '3,8'=>'1',
                                        '3,9'=>'2',
                                        '3,10'=>'2',
                                        '3,11'=>'1',
                                        '3,12'=>'2',
                                        '4,1'=>'1',
                                        '4,2'=>'2',
                                        '4,3'=>'1',
                                        '4,4'=>'1',
                                        '4,5'=>'2',
                                        '4,6'=>'2',
                                        '4,7'=>'1',
                                        '4,8'=>'1',
                                        '4,9'=>'2',
                                        '4,10'=>'1',
                                        '4,11'=>'2',
                                        '4,12'=>'2',
                                        '5,1'=>'2',
                                        '5,2'=>'2',
                                        '5,3'=>'1',
                                        '5,4'=>'2',
                                        '5,5'=>'1',
                                        '5,6'=>'1',
                                        '5,7'=>'2',
                                        '5,8'=>'2',
                                        '5,9'=>'1',
                                        '5,10'=>'1',
                                        '5,11'=>'2',
                                        '5,12'=>'1',
                                        '6,1'=>'2',
                                        '6,2'=>'1',
                                        '6,3'=>'2',
                                        '6,4'=>'2',
                                        '6,5'=>'1',
                                        '6,6'=>'2',
                                        '6,7'=>'1',
                                        '6,8'=>'1',
                                        '6,9'=>'2',
                                        '6,10'=>'2',
                                        '6,11'=>'1',
                                        '6,12'=>'1',
                                        '7,1'=>'1',
                                        '7,2'=>'1',
                                        '7,3'=>'2',
                                        '7,4'=>'1',
                                        '7,5'=>'2',
                                        '7,6'=>'2',
                                        '7,7'=>'1',
                                        '7,8'=>'2',
                                        '7,9'=>'1',
                                        '7,10'=>'1',
                                        '7,11'=>'2',
                                        '7,12'=>'2',
                                        '8,1'=>'2',
                                        '8,2'=>'2',
                                        '8,3'=>'1',
                                        '8,4'=>'1',
                                        '8,5'=>'2',
                                        '8,6'=>'1',
                                        '8,7'=>'2',
                                        '8,8'=>'2',
                                        '8,9'=>'1',
                                        '8,10'=>'2',
                                        '8,11'=>'1',
                                        '8,12'=>'1',
                                        '9,1'=>'1',
                                        '9,2'=>'1',
                                        '9,3'=>'2',
                                        '9,4'=>'2',
                                        '9,5'=>'1',
                                        '9,6'=>'1',
                                        '9,7'=>'2',
                                        '9,8'=>'1',
                                        '9,9'=>'2',
                                        '9,10'=>'2',
                                        '9,11'=>'1',
                                        '9,12'=>'2',
                                        '10,1'=>'1',
                                        '10,2'=>'2',
                                        '10,3'=>'1',
                                        '10,4'=>'1',
                                        '10,5'=>'2',
                                        '10,6'=>'2',
                                        '10,7'=>'1',
                                        '10,8'=>'1',
                                        '10,9'=>'2',
                                        '10,10'=>'1',
                                        '10,11'=>'2',
                                        '10,12'=>'2',
                                        '11,1'=>'2',
                                        '11,2'=>'2',
                                        '11,3'=>'1',
                                        '11,4'=>'2',
                                        '11,5'=>'1',
                                        '11,6'=>'1',
                                        '11,7'=>'2',
                                        '11,8'=>'2',
                                        '11,9'=>'1',
                                        '11,10'=>'1',
                                        '11,11'=>'2',
                                        '11,12'=>'1',
                                        '12,1'=>'2',
                                        '12,2'=>'1',
                                        '12,3'=>'2',
                                        '12,4'=>'2',
                                        '12,5'=>'1',
                                        '12,6'=>'2',
                                        '12,7'=>'1',
                                        '12,8'=>'1',
                                        '12,9'=>'2',
                                        '12,10'=>'2',
                                        '12,11'=>'1',
                                        '12,12'=>'1',
                                        '1,1'=>'1',
                                        '1,2'=>'1',
                                        '1,3'=>'2',
                                        '1,4'=>'1',
                                        '1,5'=>'2',
                                        '1,6'=>'2',
                                        '1,7'=>'1',
                                        '1,8'=>'2',
                                        '1,9'=>'1',
                                        '1,10'=>'1',
                                        '1,11'=>'2',
                                        '1,12'=>'2',
                                        '2,1'=>'2',
                                        '2,2'=>'2',
                                        '2,3'=>'1',
                                        '2,4'=>'1',
                                        '2,5'=>'2',
                                        '2,6'=>'1',
                                        '2,7'=>'2',
                                        '2,8'=>'2',
                                        '2,9'=>'1',
                                        '2,10'=>'2',
                                        '2,11'=>'1',
                                        '2,12'=>'1',
                                      );
                               
        public $mang_trucngay = array(
                                             1=> array(
                                                                'ten'=>'TRỰC KIẾN',
                                                                'tot'=>'Xuất hành đặng lợi, sinh con rất tốt.',
                                                                'xau'=>'Động đất ban nền, đắp nền, lót giường, vẽ họa chụp ảnh, lên quan nhậm chức, nạp lễ cầu thân, vào làm hành chánh, dâng nộp đơn từ, mở kho vựa'
                                                                ),
                                             2 => array(
                                                                'ten'=>'TRỰC TRỪ',
                                                                'tot'=>'Động đất, ban nền đắp nền, thờ cúng Táo Thần, cầu thầy chữa bệnh bằng cách mổ xẻ hay châm cứu, bốc thuốc, xả tang, khởi công làm lò nhuộm lò gốm, nữ nhân khởi đầu uống thuốc chữa bệnh.',
                                                                'xau'=>'Đẻ con nhằm ngày này khó nuôi, nên làm Âm Đức cho con, nam nhân kỵ khởi đầu uống thuốc.'
                                                                ),
                                             3 => array(
                                                                'ten'=>'TRỰC MÃN',
                                                                'tot'=>'Xuất hành, đi đường thủy, cho vay, thu nợ, mua hàng, bán hàng, nhập kho, đặt táng, kê gác, sửa chữa, lắp đặt máy, thuê thêm người, vào học kỹ nghệ, làm chuồng gà ngỗng vịt.',
                                                                'xau'=>'Lên quan lĩnh chức, uống thuốc, vào làm hành chính, dâng nộp đơn từ.'
                                                                ),
                                             4 => array(
                                                                'ten'=>'TRỰC BÌNH',
                                                                'tot'=>'Nhập vào kho, đặt táng, gắn cửa, kê gác, đặt yên chỗ máy, sửa chữa làm tàu, khai trương tàu thuyền, các việc bồi đắp thêm ( như bồi bùn, đắp đất, lót đá, xây bờ kè.) ',
                                                                'xau'=>'Lót giường đóng giường, thừa kế tước phong hay thừa kế sự nghiệp, các vụ làm cho khuyết thủng ( như đào mương, móc giếng, xả nước.)'
                                                                ),
                                             5 => array(
                                                                'ten'=>'TRỰC ĐỊNH',
                                                                'tot'=>'Động thổ, san nền, đắp nền, làm hay sửa phòng Bếp, lắp đặt máy móc, nhập học, làm lễ cầu thân, nộp đơn dâng sớ, sửa hay làm tàu thuyền, khai trương tàu thuyền, khởi công làm lò.',
                                                                'xau'=>'Mua nuôi thêm súc vật.'
                                                                ),
                                             6 => array(
                                                                'ten'=>'TRỰC CHẤP',
                                                                'tot'=>'Lập khế ước, giao dịch, động thổ san nền, cầu thầy chữa bệnh, đi săn thú cá, tìm bắt trộm cướp.',
                                                                'xau'=>'Xây đắp nền-tường'
                                                                ),
                                             7 => array(
                                                                'ten'=>'TRỰC PHÁ',
                                                                'tot'=>'Bốc thuốc, uống thuốc, chữa bệnh.',
                                                                'xau'=>'Lót giường đóng giường, cho vay, động thổ, san nền đắp nền, vẽ họa chụp ảnh, lên quan nhậm chức, thừa kế chức tước hay sự nghiệp, nhập học, học kỹ nghệ, làm lễ cầu thân, vào làm hành chính, nộp đơn dâng sớ'
                                                                ),
                                             8 => array(
                                                                'ten'=>'TRỰC NGUY',
                                                                'tot'=>'Lót giường đóng giường, đi săn thú cá, khởi công làm lò nhuộm lò gốm.',
                                                                'xau'=>'Xuất hành đường thủy.'
                                                                ),
                                             9 => array(
                                                                'ten'=>'TRỰC THÀNH',
                                                                'tot'=>'Lập khế ước, giao dịch, cho vay, thu nợ, mua hàng, bán hàng, xuất hành, đi tàu thuyền, khởi tạo, động Thổ, san nền đắp nền, gắn cửa, đặt táng, kê gác, dựng xây kho vựa, làm hay sửa chữa phòng Bếp, thờ phụng Táo Thần, lắp đặt máy móc ( hay các loại máy ), gặt lúa, đào ao giếng, tháo nước, cầu thầy chữa bệnh, mua gia súc, các việc trong vụ chăn nuôi, nhập học, làm lễ cầu thân, cưới gã, kết hôn, thuê người, nộp đơn dâng sớ, học kỹ nghệ, làm hoặc sửa tàu thuyền, khai trương tàu thuyền, vẽ tranh, tu sửa cây cối.',
                                                                'xau'=>'Kiện tụng, tranh chấp.'
                                                                ),
                                             10 => array(
                                                                'ten'=>'TRỰC THÂU',
                                                                'tot'=>'Cấy lúa gặt lúa, mua trâu, nuôi tằm, đi săn thú cá, tu sửa cây cối',
                                                                'xau'=>'Động thổ, san nền đắp nền, nữ nhân khởi ngày uống thuốc chưa bệnh, lên quan lãnh chức, thừa kế chức tước hay sự nghiệp, vào làm hành chính, nộp đơn dâng sớ, mưu sự khuất tất.'
                                                                ),
                                             11 => array(
                                                                'ten'=>'TRỰC KHAI',
                                                                'tot'=>'Xuất hành, đi tàu thuyền, khởi tạo, động thổ, san nền đắp nền, dựng xây kho vựa, làm hay sửa phòng Bếp, thờ cúng Táo Thần, đóng giường lót giường, may áo, lắp đặt cỗ máy dệt hay các loại máy, cấy lúa gặt lúa, đào ao giếng, tháo nước, các việc trong vụ chăn nuôi, mở thông hào rãnh, cầu thầy chữa bệnh, bốc thuốc, uống thuốc, mua trâu, làm rượu, nhập học, học kỹ nghệ, vẽ tranh, tu sửa cây cối.',
                                                                'xau'=>'Chôn cất.'
                                                                ),
                                             12 => array(
                                                                'ten'=>'TRỰC BẾ',
                                                                'tot'=>'Xây đắp tường, đặt táng, gắn cửa, kê gác, làm cầu. khởi công lò nhuộm lò gốm, uống thuốc, trị bệnh ( nhưng chớ trị bệnh mắt ), tu sửa cây cối.',
                                                                'xau'=>'Lên quan nhận chức, thừa kế chức tước hay sự nghiệp, nhập học, chữa bệnh mắt, các việc trong vụ chăn nuôi'
                                                                ),
                                     );                       
   
    public function __construct(){
        //$this->CI =& get_instance();
        //$this->CI->load->library('ngayamduong');
    } 
    /** HAM KHOI TAO
     * $amlich = array( 'ngay', 'thang', 'nam' );
     * $canchingay = array( 'can'=>'','chi'=> );
     **/ 
    public function xemngay_config( $duonglich = array(), $amlich = array(), $canchingay = array() ){
                         $this->ngayduong  = $duonglich[0];
                         $this->thangduong = $duonglich[1];
                         $this->namduong   = $duonglich[2];
                         $this->ngayam     = $amlich[0];
                         $this->thangam    = $amlich[1];
                         $this->namam      = $amlich[2];
                         $this->canngay    = $canchingay['can'];
                         $this->chingay    = $canchingay['chi'];
    } 
    
    /** XAC DINH TIET KHI 
     * @ param $rt = rt/id
     **/ 
    
    public function xacdinh_tietkhi( $return = 'number'  ){
                            $ngay_hien_tai  = strtotime( $this->ngayduong.'-'.$this->thangduong.'-'.$this->namduong );
                            $nam  = $this->namduong;
                            $nam1 = $nam + 1;
                            if( $ngay_hien_tai >= strtotime( '4-2-'.$nam ) &&  $ngay_hien_tai < strtotime( '19-2-'.$nam )  ){
                                  $rt = 'Lập xuân ( Bước vào mùa xuân )';
                                  $id = 1;
                            }elseif( $ngay_hien_tai >= strtotime( '19-2-'.$nam ) &&  $ngay_hien_tai < strtotime( '5-3-'.$nam ) ){
                                  $rt = 'Vũ thủy ( Mưa Ẩm )';
                                  $id = 1;
                            }elseif( $ngay_hien_tai >= strtotime( '5-3-'.$nam ) && $ngay_hien_tai < strtotime( '21-3-'.$nam ) ){
                                  $rt = 'Kinh trập ( Sâu nở )';
                                  $id = 2;
                            }elseif( $ngay_hien_tai >= strtotime( '21-3-'.$nam ) && $ngay_hien_tai < strtotime( '5-4-'.$nam ) ){
                                 $rt  = 'Xuân phân ( Giữa xuân )';
                                 $id = 2;
                            }elseif( $ngay_hien_tai >= strtotime( '5-4-'.$nam ) && $ngay_hien_tai < strtotime( '20-4-'.$nam ) ){
                                 $rt  = 'Thanh minh ( Trong sáng )';
                                 $id = 3;
                            }elseif( $ngay_hien_tai >= strtotime( '20-4-'.$nam ) && $ngay_hien_tai < strtotime( '6-5-'.$nam ) ){
                                 $rt  = 'Cốc vũ ( Mưa rào )';
                                 $id = 3;
                            }elseif( $ngay_hien_tai >= strtotime( '6-5-'.$nam ) && $ngay_hien_tai < strtotime( '21-5-'.$nam ) ){
                                 $rt  = 'Lập hạ ( Bước vào mùa hạ )';
                                 $id = 4;
                            }elseif( $ngay_hien_tai >= strtotime( '21-5-'.$nam ) && $ngay_hien_tai < strtotime( '7-6-'.$nam ) ){
                                 $rt  = 'Tiểu mãn ( Lũ nhỏ )';
                                 $id = 4;
                            }elseif( $ngay_hien_tai >= strtotime( '6-6-'.$nam ) && $ngay_hien_tai < strtotime( '22-6-'.$nam ) ){
                                 $rt  = 'Mang chủng ( Chòm sao tua rua xuất hiện )';
                                 $id = 5;
                            }elseif( $ngay_hien_tai >= strtotime( '22-6-'.$nam ) && $ngay_hien_tai < strtotime( '8-7-'.$nam ) ){
                                 $rt  = 'Hạ chí ( Giữa mùa hạ )';
                                 $id = 5;
                            }elseif( $ngay_hien_tai >= strtotime( '8-7-'.$nam ) && $ngay_hien_tai < strtotime( '24-7-'.$nam ) ){
                                 $rt  = 'Tiểu thử ( Nắng nhẹ )';
                                 $id = 6;
                            }elseif( $ngay_hien_tai >= strtotime( '24-7-'.$nam ) && $ngay_hien_tai < strtotime( '8-8-'.$nam ) ){
                                 $rt  = 'Đại thử ( Nắng oi )';
                                 $id = 6;
                            }elseif( $ngay_hien_tai >= strtotime( '7-8-'.$nam ) && $ngay_hien_tai < strtotime( '23-8-'.$nam ) ){
                                 $rt  = 'Lập thu ( Bước vào mùa thu )';
                                 $id = 7;
                            }elseif( $ngay_hien_tai >= strtotime( '23-8-'.$nam ) && $ngay_hien_tai < strtotime( '8-9-'.$nam ) ){
                                 $rt  = 'Xử thử ( Mưa ngâu )';
                                 $id = 7;
                            }elseif( $ngay_hien_tai >= strtotime( '8-9-'.$nam ) && $ngay_hien_tai < strtotime( '23-9-'.$nam ) ){
                                 $rt  = 'Bạch lộ ( Nắng phạt )';
                                 $id = 8;
                            }elseif( $ngay_hien_tai >= strtotime( '23-9-'.$nam ) && $ngay_hien_tai < strtotime( '8-10-'.$nam ) ){
                                 $rt ='Thu phân ( Giữa thu )';
                                 //$rt  = 'Hàn lộ ( Mát mẻ )';
                                 $id = 8;
                            }elseif( $ngay_hien_tai >= strtotime( '8-10-'.$nam ) && $ngay_hien_tai < strtotime( '23-10-'.$nam ) ){
                                 $rt  = 'Hàn lộ ( Mát mẻ )';
                                 //$rt  = 'Sương giáng (Sương mù bắt đầu xuất hiện)';
                                 $id = 9;
                            }elseif( $ngay_hien_tai >= strtotime( '23-10-'.$nam ) && $ngay_hien_tai < strtotime( '7-11-'.$nam ) ){
                                 $rt  = 'Sương giáng (Sương mù bắt đầu xuất hiện)';
                                 //$rt  = 'Lập đông (Bước vào mùa đông)';
                                 $id = 9;
                            }elseif( $ngay_hien_tai >= strtotime( '7-11-'.$nam ) && $ngay_hien_tai < strtotime( '22-11-'.$nam ) ){
                                 $rt  = 'Lập đông (Bước vào mùa đông)';
                                 //$rt  = 'Tiểu tuyết (Tuyết xuất hiện)';
                                 $id = 10;
                            }elseif( $ngay_hien_tai >= strtotime( '22-11-'.$nam ) && $ngay_hien_tai < strtotime( '8-12-'.$nam ) ){
                                 $rt  = 'Tiểu tuyết (Tuyết xuất hiện)';
                                 
                                 $id = 10;
                            }elseif( $ngay_hien_tai >= strtotime( '7-12-'.$nam ) && $ngay_hien_tai < strtotime( '22-12-'.$nam ) ){
                                 $rt  = 'Đại tuyết (Tuyết dày)';
                                 $id = 11;
                            }elseif( $ngay_hien_tai >= strtotime( '22-12-'.$nam ) && $ngay_hien_tai < strtotime( '6-1-'.$nam1 ) ){
                                 $rt  = 'Đông chí (Giữa đông)';
                                 $id = 11;
                            }elseif( $ngay_hien_tai >= strtotime( '6-1-'.$nam1 ) && $ngay_hien_tai < strtotime( '21-1-'.$nam1 ) ){
                                 $rt  = 'Tiểu hàn(Rét nhẹ)';
                                 $id = 12;
                            }else{
                                $rt = 'Đại hàn(Rét đậm)';
                                $id = 12;
                            }
                            if( $return != 'number' ){
                                return $rt;
                            }else{
                                return $id;
                            }

    }
    
    /** XÁC ĐỊNH NGŨ HÀNH **/
    public function xacdinh_nguhanh( $type = 'number' ){
                          $key = $this->canngay.','.$this->chingay; 
                          $number = $this->xd_nguhanh[ $key ];
                          if( $type != 'number' ){
                             return $this->nguhanh[ $number ];
                          }else{
                             return $number;
                          }
    }
    
    public function xacdinh_nhithapbattu( $so_ngay_trong_thang ){
                            $nam_bat_dau   = 2014;
                            $thang_bat_dau = 12;
                            $ngay_bat_dau  = 25;
                            $i = 1;
                            $j = 1;
                            while( $nam_bat_dau <= $this->namduong ){
                                $ngay_bat_dau++;
                                $i++;
                                if( $i > 28 ){
                                    $i = 1; 
                                }
                                if( $ngay_bat_dau > $so_ngay_trong_thang ){
                                    $ngay_bat_dau = 1;
                                    $thang_bat_dau++;
                                }
                                
                                if( $thang_bat_dau > 12 ){
                                    $thang_bat_dau = 1; 
                                }
                                
                                if( $ngay_bat_dau == 1 && $thang_bat_dau == 1 ){
                                    $nam_bat_dau ++;
                                }
                                
                                if( $ngay_bat_dau ==  $this->ngayduong && $thang_bat_dau == $this->thangduong && $nam_bat_dau == $this->namduong ){
                                    break;
                                }  
                            }
                            
                            $mang[1] = array( 
                                                'ten'=>'Giác mộc giao',
                                                'ghichu'=>'(Bình Tú) Tướng tinh con Giao Long, chủ trị ngày thứ 5.',
                                                'nen'=>'Đỗ đạt, hôn nhân thành tựu.tạo tác mọi việc đều đặng vinh xương, tấn lợi. Hôn nhân cưới gã sanh con quý. Công danh khoa cử cao thăng, đỗ đạt.',
                                                'kieng'=>'chôn cất hoạn nạn ba năm. Sửa chữa hay xây đắp mộ phần ắt có người chết. Sanh con nhằm ngày có Sao Giác khó nuôi, nên lấy tên Sao mà đặt tên cho nó mới an toàn. Dùng tên sao của năm hay của tháng cũng được.',
                                                'ngoaile'=>'Sao Giác trúng ngày Dần là Đăng Viên được ngôi cao cả, mọi sự tốt đẹp.
                                                            Sao Giác trúng ngày Ngọ là Phục Đoạn Sát: rất Kỵ chôn cất, xuất hành, thừa kế, chia lãnh gia tài, khởi công lò nhuộm lò gốm. NHƯNG Nên dứt vú trẻ em, xây tường, lấp hang lỗ, làm cầu tiêu, kết dứt điều hung hại.
                                                            Sao Giác trúng ngày Sóc là Diệt Một Nhật: Đại Kỵ đi thuyền, và cũng chẳng nên làm rượu, lập lò gốm lò nhuộm, vào làm hành chánh, thừa kế.
                                                            '
                                                );
                            $mang[2] = array( 
                                                'ten'=>'Cang kim long',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con Rồng, chủ trị ngày thứ 6.',
                                                'nen'=>'cắt may áo màn (sẽ có lộc ăn).',
                                                'kieng'=>'Chôn cất bị Trùng tang. Cưới gã e phòng không giá lạnh. Tranh đấu kiện tụng lâm bại. Khởi dựng nhà cửa chết con đầu. 10 hoặc 100 ngày sau thì gặp họa, rồi lần lần tiêu hết ruộng đất, nếu làm quan bị cách chức. Sao Cang thuộc Thất Sát Tinh, sanh con nhằm ngày này ắt khó nuôi, nên lấy tên của Sao mà đặt cho nó thì yên lành.',
                                                'ngoaile'=>'Sao Cang ở nhằm ngày Rằm là Diệt Một Nhật: Cữ làm rượu, lập lò gốm lò nhuộm, vào làm hành chánh, thừa kế sự nghiệp, thứ nhất đi thuyền chẳng khỏi nguy hại (vì Diệt Một có nghĩa là chìm mất).
                                                    sao Cang tại Hợi, Mẹo, Mùi trăm việc đều tốt. Thứ nhất tại Mùi.
                                                    '
                                                );
                            $mang[3] = array( 
                                                'ten'=>'Đê lạc thổ',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con Lạc Đà, chủ trị ngày thứ 7',
                                                'nen'=>'Sao Đê Đại Hung, không cò việc chi hạp với nó.',
                                                'kieng'=>'Khởi công xây dựng, chôn cất, cưới gã, xuất hành kỵ nhất là đường thủy, sanh con chẳng phải điềm lành nên làm Âm Đức cho nó. Đó chỉ là các việc Đại Kỵ, các việc khác vẫn kiêng cữ.',
                                                'ngoaile'=>'Tại Thân, Tý, Thìn trăm việc đều tốt, nhưng Thìn là tốt hơn hết vì Sao Đê Đăng Viên tại Thìn.'
                                                );
                            $mang[4] = array( 
                                                'ten'=>'Phòng nhật thố',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con Thỏ, chủ trị ngày Chủ nhật.',
                                                'nen'=>'Khởi công tạo tác mọi việc đều tốt, thứ nhất là xây dựng nhà, chôn cất, cưới gã, xuất hành, đi thuyền, mưu sự, chặt cỏ phá đất, cắt áo.',
                                                'kieng'=>'Sao Phòng là Đại Kiết Tinh, không kỵ việc chi cả.',
                                                'ngoaile'=>'Tại Đinh Sửu và Tân Sửu đều tốt, tại Dậu càng tốt hơn, vì Sao Phòng Đăng Viên tại Dậu.'
                                                );
                            $mang[5] = array( 
                                                'ten'=>'Tâm nguyệt hồ',
                                                'ghichu'=>'(Hung tú) Tướng tinh con chồn, chủ trị ngày thứ 2.',
                                                'nen'=>'Tạo tác việc chi cũng không hạp với Hung tú này.',
                                                'kieng'=>'Khởi công tạo tác việc chi cũng không khỏi hại, thứ nhất là xây cất, cưới gã, chôn cất, đóng giường, lót giường, tranh tụng.',
                                                'ngoaile'=>'Ngày Dần Sao Tâm Đăng Viên, có thể dùng các việc nhỏ'
                                                );
                            $mang[6] = array( 
                                                'ten'=>'Vĩ hỏa hổ',
                                                'ghichu'=>'(Kiết Tú) tướng tinh con cọp, chủ trị ngày thứ 3.',
                                                'nen'=>'Mọi việc đều tốt, tốt nhất là các vụ khởi tạo, chôn cất, cưới gã, xây cất, trổ cửa, đào ao giếng, khai mương rạch, các vụ thủy lợi, khai trương, chặt cỏ phá đất.',
                                                'kieng'=>'Đóng giường, lót giường, đi thuyền.',
                                                'ngoaile'=>'Tại Hợi, Mẹo, Mùi Kỵ chôn cất. Tại Mùi là vị trí Hãm Địa của Sao Vỹ. Tại Kỷ Mẹo rất Hung, còn các ngày Mẹo khác có thể tạm dùng được.'
                                                );
                            $mang[7] = array( 
                                                'ten'=>'Cơ thủy báo',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con Beo, chủ trị ngày thứ 4.',
                                                'nen'=>'Khởi tạo trăm việc đều tốt, tốt nhất là chôn cất, tu bổ mồ mã, trổ cửa, khai trương, xuất hành, các vụ thủy lợi (như tháo nước, đào kinh, khai thông mương rảnh...)',
                                                'kieng'=>'Đóng giường, lót giường, đi thuyền.',
                                                'ngoaile'=>'Tại Thân, Tý, Thìn trăm việc kỵ, duy tại Tý có thể tạm dùng. Ngày Thìn Sao Cơ Đăng Viên lẽ ra rất tốt nhưng lại phạm Phục Đoạn. Phạm Phục Đoạn thì kỵ chôn cất, xuất hành, các vụ thừa kế, chia lãnh gia tài, khởi công làm lò nhuộm lò gốm; NHƯNG nên dứt vú trẻ em, xây tường, lấp hang lỗ, làm cầu tiêu, kết dứt điều hung hại.'
                                                );
                            $mang[8] = array( 
                                                'ten'=>'Đẩu mộc giải',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con cua, chủ trị ngày thứ 5.',
                                                'nen'=>'Khởi tạo trăm việc đều tốt, tốt nhất là xây đắp hay sửa chữa phần mộ, trổ cửa, tháo nước, các vụ thủy lợi, chặt cỏ phá đất, may cắt áo mão, kinh doanh, giao dịch, mưu cầu công danh.',
                                                'kieng'=>'Rất kỵ đi thuyền. Con mới sanh đặt tên nó là Đẩu, Giải, Trại hoặc lấy tên Sao của năm hay tháng hiện tại mà đặt tên cho nó dễ nuôi.',
                                                'ngoaile'=>'Tại Tị mất sức. Tại Dậu tốt. Ngày Sửu Đăng Viên rất tốt nhưng lại phạm Phục Đoạn. Phạm Phục Đoạn thì kỵ chôn cất, xuất hành, thừa kế, chia lãnh gia tài, khởi công làm lò nhuộm lò gốm; NHƯNG nên dứt vú trẻ em, xây tường, lấp hang lỗ, làm cầu tiêu, kết dứt điều hung hại.'
                                                );
                            $mang[9] = array( 
                                                'ten'=>'Ngưu kim ngưu',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con trâu, chủ trị ngày thứ 6.',
                                                'nen'=>'Đi thuyền, cắt may áo mão.',
                                                'kieng'=>'Khởi công tạo tác việc chi cũng hung hại. Nhất là xây cất nhà, dựng trại, cưới gã, trổ cửa, làm thủy lợi, nuôi tằm, gieo cấy, khai khẩn, khai trương, xuất hành đường bộ.',
                                                'ngoaile'=>'Ngày Ngọ Đăng Viên rất tốt. Ngày Tuất yên lành. Ngày Dần là Tuyệt Nhật, chớ động tác việc chi, riêng ngày Nhâm Dần dùng được.
                                                            Trúng ngày 14 ÂL là Diệt Một Sát, cữ: làm rượu, lập lò nhuộm lò gốm, vào làm hành chánh, thừa kế sự nghiệp, kỵ nhất là đi thuyền chẳng khỏi rủi ro.
                                                            Sao Ngưu là một trong Thất sát Tinh, sanh con khó nuôi, nên lấy tên Sao của năm, tháng hay ngày mà đặt tên cho trẻ và làm việc Âm Đức ngay trong tháng sanh nó mới mong nuôi khôn lớn được.
                                                            '
                                                );
                            $mang[10] = array( 
                                                'ten'=>'Nữ thổ bức',
                                                'ghichu' =>'(Hung Tú) Tướng tinh con dơi, chủ trị ngày thứ 7.',
                                                'nen'    =>'Kết màn, may áo.',
                                                'kieng'  =>'Khởi công tạo tác trăm việc đều có hại, hung hại nhất là trổ cửa, khơi đường tháo nước, chôn cất, đầu đơn kiện cáo.',
                                                'ngoaile'=>'Tại Hợi Mẹo Mùi đều gọi là đường cùng. Ngày Quý Hợi cùng cực đúng mức vì là ngày chót của 60 Hoa giáp. Ngày Hợi tuy Sao Nữ Đăng Viên song cũng chẳng nên dùng.
                                                            Ngày Mẹo là Phục Đoạn Sát, rất kỵ chôn cất, xuất hành, thừa kế sự nghiệp, chia lãnh gia tài, khởi công làm lò nhuộm lò gốm; NHƯNG nên dứt vú trẻ em, xây tường, lấp hang lỗ, làm cầu tiêu, kết dứt điều hung hại.
                                                            '
                                                );
                            $mang[11] = array( 
                                                'ten'=>'Hư nhật thử',
                                                'ghichu' =>'(Hung Tú) Tướng tinh con chuột, chủ trị ngày chủ nhật.',
                                                'nen'    =>'Hư có nghĩa là hư hoại, không có việc chi hợp với Sao Hư.',
                                                'kieng'  =>'Khởi công tạo tác trăm việc đều không may, thứ nhất là xây cất nhà cửa, cưới gã, khai trương, trổ cửa, tháo nước, đào kinh rạch.',
                                                'ngoaile'=>'Gặp Thân, Tý, Thìn đều tốt, tại Thìn Đắc Địa tốt hơn hết. Hạp với 6 ngày Giáp Tý, Canh Tý, Mậu Thân, Canh Thân, Bính Thìn, Mậu Thìn có thể động sự. Trừ ngày Mậu Thìn ra, còn 5 ngày kia kỵ chôn cất.
                                                            Gặp ngày Tý thì Sao Hư Đăng Viên rất tốt, nhưng lại phạm Phục Đoạn Sát: Kỵ chôn cất, xuất hành, thừa kế, chia lãnh gia tài sự nghiệp, khởi công làm lò nhuộm lò gốm, NHƯNg nên dứt vú trẻ em, xây tường, lấp hang lỗ, làm cầu tiêu, kết dứt điều hung hại.
                                                            Gặp Huyền Nhật là những ngày 7, 8 , 22, 23 ÂL thì Sao Hư phạm Diệt Một: Cữ làm rượu, lập lò gốm lò nhuộm, vào làm hành chánh, thừa kế, thứ nhất là đi thuyền ắt chẳng khỏi rủi ro.
                                                            '
                                                );
                            $mang[12] = array( 
                                                'ten'=>'Nguy nguyệt yến',
                                                'ghichu'=>'(Bình Tú) Tứng tinh con chim én, chủ trị ngày thứ 2.',
                                                'nen'=>'Chôn cất rất tốt, lót giường bình yên.',
                                                'kieng'=>'Dựng nhà, trổ cửa, gác đòn đông, tháo nước, đào mương rạch, đi thuyền.',
                                                'ngoaile'=>'Tại Tị, Dậu, Sửu trăm việc đều tốt, tại Dậu tốt nhất. Ngày Sửu Sao Nguy Đăng Viên: tạo tác sự việc được quý hiển.'
                                                );
                            $mang[13] = array( 
                                                'ten'=>'Thất hỏa trư',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con heo, chủ trị ngày thứ 3.',
                                                'nen'=>'Khởi công trăm việc đều tốt. Tốt nhất là xây cất nhà cửa, cưới gã, chôn cất, trổ cửa, tháo nước, các việc thủy lợi, đi thuyền, chặt cỏ phá đất.',
                                                'kieng'=>'Sao Thất Đại Kiết không có việc chi phải cữ.',
                                                'ngoaile'=>'Tại Dần, Ngọ, Tuất nói chung đều tốt, ngày Ngọ Đăng viên rất hiển đạt. 
                                                            Ba ngày Bính Dần, Nhâm Dần, Giáp Ngọ rất nên xây dựng và chôn cất, song những ngày Dần khác không tốt. Vì sao Thất gặp ngày Dần là phạm Phục Đoạn Sát (kiêng cữ như trên).
                                                            '
                                                );
                            $mang[14] = array( 
                                                'ten'=>'Bích thủy du',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con rái cá, chủ trị ngày thứ 4',
                                                'nen'=>'Khởi công tạo tác việc chi cũng tốt. Tốt nhất là xây cất nhà, cưới gã, chôn cất, trổ cửa, dựng cửa, tháo nước, các vụ thuỷ lợi, chặt cỏ phá đất, cắt áo thêu áo, khai trương, xuất hành, làm việc thiện ắt Thiện quả tới mau hơn.',
                                                'kieng'=>'Sao Bích toàn kiết, không có việc chi phải kiêng cữ.',
                                                'ngoaile'=>'Tại Hợi Mẹo Mùi trăm việc kỵ, thứ nhất trong Mùa Đông. Riêng ngày Hợi Sao Bích Đăng Viên nhưng phạm Phục Đọan Sát (Kiêng cữ như trên)'
                                                );
                            $mang[15] = array( 
                                                'ten'    =>'Khuê mộc lang',
                                                'ghichu' =>'(Bình Tú) Tướng tinh con chó sói, chủ trị ngày thứ 5.',
                                                'nen'    =>'Tạo dựng nhà phòng, nhập học, ra đi cầu công danh, cắt áo.',
                                                'kieng'  =>'Chôn cất, khai trương, trổ cửa dựng cửa, khai thông đường nước, đào ao móc giếng, thưa kiện, đóng giường lót giường.',
                                                'ngoaile'=>'Sao Khuê là một trong Thất Sát Tinh, nếu đẻ con nhằm ngày này thì nên lấy tên Sao Khuê hay lấy tên Sao của năm tháng mà đặt cho trẻ dễ nuôi.
                                                            Sao Khuê Hãm Địa tại Thân: Văn Khoa thất bại.
                                                            Tại Ngọ là chỗ Tuyệt gặp Sanh, mưu sự đắc lợi, thứ nhất gặp Canh Ngọ.
                                                            Tại Thìn tốt vừa vừa.
                                                            Ngày Thân Sao Khuê Đăng Viên: Tiến thân danh.
                                                            '
                                                );
                            $mang[16] = array( 
                                                'ten'=>'Lâu kim cẩu',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con chó, chủ trị ngày thứ 6.',
                                                'nen'=>'Khởi công mọi việc đều tốt. Tốt nhất là dựng cột, cất lầu, làm dàn gác, cưới gã, trổ cửa, dựng cửa, tháo nước hay các vụ thủy lợi, cắt áo.',
                                                'kieng'=>'Đóng giường, lót giường, đi đường thủy.',
                                                'ngoaile'=>'Tại Ngày Dậu Đăng Viên: Tạo tác đại lợi.
                                                            Tại Tị gọi là Nhập Trù rất tốt.
                                                            Tại Sửu tốt vừa vừa.
                                                            Gặp ngày cuối tháng thì Sao Lâu phạm Diệt Một: rất kỵ đi thuyền, cữ làm rượu, lập lò gốm lò nhuộm, vào làm hành chánh, thừa kế sự nghiệp.
                                                            '
                                                );
                            $mang[17] = array( 
                                                'ten'=>'Vị thổ trĩ',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con chim trĩ, chủ trị ngày thứ 7.',
                                                'nen'=>'Khởi công tạo tác việc chi cũng lợi. Tốt nhất là xây cất, cưới gã, chôn cất, chặt cỏ phá đất, gieo trồng, lấy giống.',
                                                'kieng'=>'Đi thuyền.',
                                                'ngoaile'=>'Sao Vị mất chí khí tại Dần, thứ nhất tại Mậu Dần, rất là Hung, chẳng nên cưới gã, xây cất nhà cửa.
                                                            Tại Tuất Sao Vị Đăng Viên nên mưu cầu công danh, nhưng cũng phạm Phục Đoạn (kiêng cữ như các mục trên).
                                                            '
                                                );
                            $mang[18] = array( 
                                                'ten'=>'Mão nhật kê',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con gà, chủ trị ngày chủ nhật.',
                                                'nen'=>'Xây dựng, tạo tác.',
                                                'kieng'=>'Chôn Cất (ĐẠI KỴ), cưới gã, trổ cửa dựng cửa, khai ngòi phóng thủy, khai trương, xuất hành, đóng giường lót giường. Các việc khác cũng không hay.',
                                                'ngoaile'=>'Tại Mùi mất chí khí.
                                                            Tại Ất Mẹo và Đinh Mẹo tốt, Ngày Mẹo Đăng Viên cưới gã tốt, nhưng ngày Quý Mẹo tạo tác mất tiền của.
                                                            Hạp với 8 ngày: Ất Mẹo, Đinh Mẹo, Tân Mẹo, Ất Mùi, Đinh Mùi, Tân Mùi, Ất Hợi, Tân Hợi.
                                                            '
                                                );
                            $mang[19] = array( 
                                                'ten'=>'Tất nguyêt ô',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con quạ, chủ trị ngày thứ 2.',
                                                'nen'=>'Khởi công tạo tác việc chi cũng tốt. Tốt nhất là chôn cất, cưới gã, trổ cửa dựng cửa, đào kinh, tháo nước, khai mương, móc giếng, chặt cỏ phá đất. Những việc khác cũng tốt như làm ruộng, nuôi tằm, khai trương, xuất hành, nhập học.',
                                                'kieng'=>'Đi thuyền',
                                                'ngoaile'=>'Tại Thân, Tý, Thìn đều tốt. Tại Thân hiệu là Nguyệt Quải Khôn Sơn, trăng treo đầu núi Tây Nam, rất là tốt . Lại thêm Sao Tất Đăng Viên ở ngày Thân, cưới gã và chôn cất là 2 điều ĐẠI KIẾT.'
                                                );
                            $mang[20] = array( 
                                                'ten'=>'Chủy hỏa hâu',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con khỉ, chủ trị ngày thứ 3.',
                                                'nen'=>'Không có sự việc chi hợp với Sao Chủy.',
                                                'kieng'=>'Khởi công tạo tác việc chi cũng không tốt. KỴ NHẤT là chôn cất và các vụ thuộc về chết chôn như sửa đắp mồ mả, làm sanh phần (làm mồ mã để sẵn), đóng thọ đường (đóng hòm để sẵn).',
                                                'ngoaile'=>'Tại Tị bị đoạt khí, Hung càng thêm Hung.
                                                            Tại Dậu rất tốt, vì Sao Chủy Đăng Viên ở Dậu, khởi động thăng tiến. Nhưng cũng phạm Phục Đoạn Sát (kiêng cữ xem ở các mục trên).
                                                            Tại Sửu là Đắc Địa, ắt nên. Rất hợp với ngày Đinh Sửu và Tân Sửu, tạo tác Đại Lợi, chôn cất Phú Quý song toàn.
                                                            '
                                                );
                            $mang[21] = array( 
                                                'ten'=>'Sâm thủy viên',
                                                'ghichu'=>'(Bình Tú) Tướng tinh con vượn, chủ trị ngày thứ 4.',
                                                'nen'=>'Khởi công tạo tác nhiều việc tốt như: xây cất nhà, dựng cửa trổ cửa, nhập học, đi thuyền, làm thủy lợi, tháo nước đào mương.',
                                                'kieng'=>'Cưới gã, chôn cất, đóng giường lót giường, kết bạn.',
                                                'ngoaile'=>'Ngày Tuất Sao sâm Đăng Viên, nên phó nhậm, cầu công danh hiển hách.'
                                                );
                            $mang[22] = array( 
                                                'ten'=>'Tỉnh mộc can',
                                                'ghichu'=>'(Bình Tú) Tướng tinh con dê trừu, chủ trị ngày thứ 5.',
                                                'nen'=>'Tạo tác nhiều việc tốt như xây cất, trổ cửa dựng cửa, mở thông đường nước, đào mương móc giếng, nhậm chức, nhập học, đi thuyền.',
                                                'kieng'=>'Chôn cất, tu bổ phần mộ, làm sanh phần, đóng thọ đường.',
                                                'ngoaile'=>'Tại Hợi, Mẹo, Mùi trăm việc tốt. Tại Mùi là Nhập Miếu, khởi động vinh quang.'
                                                );
                            $mang[23] = array( 
                                                'ten'=>'Quỷ kim dương',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con dê, chủ trị ngày thứ 6.',
                                                'nen'=>'Chôn cất, chặt cỏ phá đất, cắt áo.',
                                                'kieng'=>'Khởi tạo việc chi cũng hại. Hại nhất là xây cất nhà, cưới gã, trổ cửa dựng cửa, tháo nước, đào ao giếng, động đất, xây tường, dựng cột.',
                                                'ngoaile'=>'Ngày Tý Đăng Viên thừa kế tước phong tốt, phó nhiệm may mắn.
                                                            Ngày Thân là Phục Đoạn Sát kỵ chôn cất, xuất hành, thừa kế, chia lãnh gia tài, khởi công lập lò gốm lò nhuộm; NHƯNG nên dứt vú trẻ em, xây tường, lấp hang lỗ, làm cầu tiêu, kết dứt điều hung hại.
                                                            Nhằm ngày 16 ÂL là ngày Diệt Một kỵ làm rượu, lập lò gốm lò nhuộm, vào làm hành chánh, kỵ nhất đi thuyền.
                                                            '
                                                );
                            $mang[24] = array( 
                                                'ten'=>'Liễu thổ chương',
                                                'ghichu'=>'(Hung tú) Tướng tinh con gấu ngựa, chủ trị ngày thứ 7.',
                                                'nen'=>'Không có việc chi hạp với Sao Liễu.',
                                                'kieng'=>'Khởi công tạo tác việc chi cũng hung hại. Hung hại nhất là chôn cất, xây đắp, trổ cửa dựng cửa, tháo nước, đào ao lũy, làm thủy lợi.',
                                                'ngoaile'=>'Tại Ngọ trăm việc tốt.
                                                            Tại Tị Đăng Viên: thừa kế và lên quan lãnh chức là hai điều tốt nhất.
                                                            Tại Dần, Tuất rất kỵ xây cất và chôn cất: Rất suy vi.
                                                            '
                                                );
                            $mang[25] = array( 
                                                'ten'=>'Tinh nhật mã',
                                                'ghichu'=>'(Bình Tú) Tướng tinh con ngựa, chủ trị ngày chủ nhật.',
                                                'nen'=>'Xây dựng phòng mới.',
                                                'kieng'=>'Chôn cất, cưới gã, mở thông đường nước.',
                                                'ngoaile'=>'Sao Tinh là một trong Thất Sát Tinh, nếu sanh con nhằm ngày này nên lấy tên Sao đặt tên cho trẻ để dễ nuôi, có thể lấy tên sao của năm, hay sao của tháng cũng được.
                                                            Tại Dần Ngọ Tuất đều tốt, tại Ngọ là Nhập Miếu, tạo tác được tôn trọng.
                                                            Tại Thân là Đăng Giá (lên xe): xây cất tốt mà chôn cất nguy.
                                                            Hạp với 7 ngày: Giáp Dần, Nhâm Dần, Giáp Ngọ, Bính Ngọ, Mậu Ngọ, Bính Tuất, Canh Tuất.
                                                            '
                                                );
                            $mang[26] = array( 
                                                'ten'=>'Trương nguyệt lộc',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con nai, chủ trị ngày thứ 2.',
                                                'nen'=>'Khởi công tạo tác trăm việc tốt, tốt nhất là xây cất nhà, che mái dựng hiên, trổ cửa dựng cửa, cưới gã, chôn cất, làm ruộng, nuôi tằm, đặt táng kê gác, chặt cỏ phá đất, cắt áo, làm thuỷ lợi.',
                                                'kieng'=>'Sửa hoặc làm thuyền chèo, đẩy thuyền mới xuống nước',
                                                'ngoaile'=>'Tại Hợi, Mẹo, Mùi đều tốt. Tại Mùi Đăng viên rất tốt nhưng phạm Phục Đoạn (xem kiêng cữ như các mục trên).'
                                                );
                            $mang[27] = array( 
                                                'ten'=>'Dực hỏa xà',
                                                'ghichu'=>'(Hung Tú) Tướng tinh con rắn, chủ trị ngày thứ 3.',
                                                'nen'=>'Cắt áo sẽ được tiền tài.',
                                                'kieng'=>'Chôn cất, cưới gã, xây cất nhà, đặt táng kê gác, gác đòn đông, trổ cửa gắn cửa, các vụ thủy lợi.',
                                                'ngoaile'=>'Tại Thân, Tý, Thìn mọi việc tốt. Tại Thìn Vượng Địa tốt hơn hết. Tại Tý Đăng Viên nên thừa kế sự nghiệp, lên quan lãnh chức.'
                                                );
                            $mang[28] = array( 
                                                'ten'=>'Chẩn thủy dẫn',
                                                'ghichu'=>'(Kiết Tú) Tướng tinh con giun, chủ trị ngày thứ 4.',
                                                'nen'=>'Khởi công tạo tác mọi việc tốt lành, tốt nhất là xây cất lầu gác, chôn cất, cưới gã. Các việc khác cũng tốt như dựng phòng, cất trại, xuất hành, chặt cỏ phá đất.',
                                                'kieng'=>'Đi thuyền.',
                                                'ngoaile'=>'Tại Tị Dậu Sửu đều tốt. Tại Sửu Vượng Địa, tạo tác thịnh vượng.
                                                Tại Tị Đăng Viên là ngôi tôn đại, mưu động ắt thành danh.
                                                '
                                                );
                             return $mang[$i];
    }
    
    /** XAC DINH TUOI XUNG NGAY **/
    public function xacdinh_tuoi_xung_ngay(){
             $mang = array(
                                '1,1'=>'Mậu Ngọ – Nhâm Ngọ',
                                '2,2'=>'Kỷ Mùi – Quý Mùi',
                                '3,3'=>'Canh Thân – Nhâm Thân',
                                '4,4'=>'Tân Dậu – Quý Dậu',
                                '5,5'=>'Nhâm Tuất – Bính Tuất',
                                '6,6'=>'Quý Hợi – Đinh Hợi',
                                '7,7'=>'Bính Tý – Canh Tý',
                                '8,8'=>'Ất Sửu – Đinh Sửu',
                                '9,9'=>'Bính Thân – Canh Dần',
                                '10,10'=>'Đinh Mão – Tân Mão',
                                '1,11'=>'Mậu Thìn – Canh Thìn',
                                '2,12'=>'Kỷ Tị – Tân Tị',
                                '3,1'=>'Canh Ngọ – Mậu Ngọ',
                                '4,2'=>'Tân Mùi – Kỷ Mùi',
                                '5,3'=>'Nhâm Thân – Giáp Thân',
                                '6,4'=>'Quý Dậu – Ất Dậu',
                                '7,5'=>'Giáp Tuất – Mậu Tuất',
                                '8,6'=>'Ất Hợi – Kỷ Hợi',
                                '9,7'=>'Bính Tý – Canh Tý',
                                '10,8'=>'Đinh Sửu – Tân Sửu',
                                '1,9'=>'Mậu Dần – Bính Dần',
                                '2,10'=>'Kỷ Mão – Đinh Mão',
                                '3,11'=>'Canh Thìn – Nhâm Thìn',
                                '4,12'=>'Tân Tị – Quý Tị',
                                '5,1'=>'Nhâm Ngọ – Giáp Ngọ',
                                '6,2'=>'Quý Mùi – Ất Mùi',
                                '7,3'=>'Giáp Thân – Mậu Thân',
                                '8,4'=>'Ất Dậu – Kỷ Dậu',
                                '9,5'=>'Bính Tuất – Giáp Tuất',
                                '10,6'=>'Đinh Hợi – Ất Hợi',
                                '1,7'=>'Mậu Tý – Nhâm Tý',
                                '2,8'=>'Kỷ Sửu – Quý Sửu',
                                '3,9'=>'Canh Dần – Nhâm Dần',
                                '4,10'=>'Tân Mão – Quý Mão',
                                '5,11'=>'Nhâm Thìn – Bính Thìn',
                                '6,12'=>'Quý Tị – Đinh Tị',
                                '7,1'=>'Giáp Ngọ – Bính Ngọ',
                                '8,2'=>'Ất Mùi – Đinh Mùi',
                                '9,3'=>'Bính Thân – Canh Thân',
                                '10,4'=>'Đinh Dậu – Tân Dậu',
                                '1,5'=>'Mậu Tuất – Canh Tuất',
                                '2,6'=>'Kỷ Hợi – Tân Hợi',
                                '3,7'=>'Canh Tý – Mậu Tý',
                                '4,8'=>'Tân Sửu – Kỷ Sửu',
                                '5,9'=>'Nhâm Dần – Giáp Dần',
                                '6,10'=>'Quý Mão – Ất Mão',
                                '7,11'=>'Giáp Thìn – Mậu Thìn',
                                '8,12'=>'Kỷ Tị – Đinh Tị',
                                '9,1'=>'Bính Ngọ – Canh Ngọ',
                                '10,2'=>'Đinh Mùi – Tân Mùi',
                                '1,3'=>'Mậu Thân – Bính Thân',
                                '2,4'=>'Kỷ Dậu – Tân Dậu',
                                '3,5'=>'Canh Tuất – Nhâm Tuất',
                                '4,6'=>'Tân Hợi – Quý Hợi',
                                '5,7'=>'Nhâm Tý – Giáp Tý',
                                '6,8'=>'Quý Sửu – Ất Sửu',
                                '7,9'=>'Giáp Dần – Mậu Dần',
                                '8,10'=>'Ất Mão – Kỷ Mão',
                                '9,11'=>'Bính Thìn – Mậu Thìn',
                                '10,12'=>'Đinh Tị – Ất Tị',
                          );
                $key = $this->canngay.','.$this->chingay;
                if( isset( $mang[ $key ] ) ){
                     return $mang[ $key ];
                }          
        }
        
    /** XAC DINH LUC DIEU **/
    
    public function xacdinh_lucdieu(){
                         $mang = array();
                         $mang[1] = array(
                                            'ten'=>'Đại an',
                                            'tot'=>'Mọi việc đều tốt, nên dùng để mưu việc đại sự',
                                            'xau'=>'' 
                                            );
                         $mang[2] = array(
                                            'ten'=>'Lưu niên',  
                                            'tot'=>'',
                                            'xau'=>'Mọi việc đều bị trễ nải dây dưa, rất khó hoàn thành, dễ gặp những chuyện thị phi, khẩu thiệt. Việc hành chính, giấy tờ, luật pháp, dâng nộp đơn từ, ký kết hợp đồng cũng không thể vội vã được' 
                                            );
                         $mang[3] = array(
                                            'ten'=>'Tốc hỷ',
                                            'tot'=>'Niềm vui nhanh chóng, dùng để mưu đại sự, sẽ có thành công mau lẹ, bất ngờ, tốt nhất là tiến hành vào buổi sáng của ngày.',
                                            'xau'=>'' 
                                            );
                         $mang[4] = array(
                                            'ten'=>'Xích khẩu',   
                                            'tot'=>'',
                                            'xau'=>'Là ngày xấu, mưu sự dễ dẫn đến nội bộ mâu thuẫn, cãi vã, thị phi, khẩu thiệt, làm ơn nên oán.' 
                                            );
                         $mang[5] = array(
                                            'ten'=>'Tiểu cát',
                                            'tot'=>'Mưu đại sự thì mọi chuyện hanh thông thuận lợi, được quý nhân nâng đỡ, âm phúc độ trì che chở.',
                                            'xau'=>'' 
                                            );
                         $mang[6] = array(
                                            'ten'=>'Không vong',
                                            'tot'=>'',
                                            'xau'=>'Mọi việc đi vào thế bế tắc, trở ngại, tiến độ công việc trì trệ, tiền bạc thất thoát, danh vọng, uy tín bị giảm xuống. Là một ngày xấu về mọi mặt, mưu sự rất khó thành công' 
                                            );
                         $j = 0;
                         for( $i = 1; $i<= $this->thangam; $i++ ){
                            $j++;
                            if( $j > 6 ){
                                 $j = 1;
                            }
                            
                         }
                         for( $i = 1; $i< $this->ngayam; $i++ ){
                            $j++;
                            if( $j > 6 ){
                                 $j = 1;
                            }
                            
                         }
                         
                         return $mang[$j];
    }    
        
     /** XAC DINH NGAY KỴ **/
     public function xacdinh_ngayky(){
                          if( in_array( $this->ngayam, array(3,7,13,18,22,27) ) ){
                              $rt = 'Ngày Tam Nương';
                          }elseif( in_array( $this->ngayam, array( 5,14,23 ) ) ){
                              $rt = 'Ngày Nguyệt Kỵ';
                          }else{
                             $rt = 'Không có';
                          }
                          
                          return $rt;
     }   
        
    /** XAC DINH GIO HOANG DAO **/
    public function xacdinh_giohoangdao(){
                          $rt = array();
                          for( $i = 1; $i<= 12; $i++ ){
                              $key = $this->chingay.','.$i;
                              if( isset( $this->xd_giohoangdao[ $key ] ) ){
                                  if( $this->xd_giohoangdao[ $key ] == 1 ){
                                      $rt['hoang_dao'][] = $this->giohoangdao[ $i ];
                                  }else{
                                      $rt['hac_dao'][]   = $this->giohoangdao[ $i ];
                                  }
                              }
                         }
                         return $rt;
    }    
                                                          
    /** XÁC ĐỊNH SAO HUNG TINH THEO THÁNG ÂM VÀ CAN NGÀY **/
    public function xacdinh_saohungtinh_tcan( $rt = 'number' ){
                        $key    = $this->thangam . ',' . $this->canngay;
                        if( isset( $this->xd_saohungtinh_thangam_canngay[ $key ] ) ){
                            $number =  $this->xd_saohungtinh_thangam_canngay[ $key ];
                        }
                        if( isset( $number ) ){
                            if( $rt == 'number' ){
                                 return $number;
                            }else{
                                 return $this->saohungtinh_thangam_canngay[$number];
                            }
                        }    
    }
    
    /** XAC DINH SAO HUNG TINH THEO CHI NGAY **/
    public function xacdinh_saohungtinh_tchi( $rt = 'number' ){
                        $key    = $this->thangam . ',' . $this->chingay;
                        if( isset( $this->xd_saohungtinh_thangam_chingay[ $key ] ) ){
                            $array =  $this->xd_saohungtinh_thangam_chingay[ $key ];
                        } 
                        if( isset( $array ) ){
                             if( $rt == 'number' ){
                                 return $array;
                             }else{
                                $array = explode(',',$array);
                                $mang  = array();
                                foreach( $array as $val ){
                                     $mang[] = $this->saohungtinh_thangam_chingay[ $val ];
                                }
                                return $mang;
                             }
                        }
    }
    
    /** XÁC ĐỊNH SAO HUNG TINH THEO THÁNG ÂM VÀ CHI NGÀY **/
    public function xacdinh_saohungtinh_tcanchi( $rt = 'number' ){
                        $key    = $this->thangam . ','. $this->canngay. ',' . $this->chingay;
                        if( isset( $this->xd_saohungtinh_thangam_canngay_chingay[ $key ] ) ){
                            $array =  $this->xd_saohungtinh_thangam_canngay_chingay[ $key ];
                        }
                        if( isset( $array ) ){
                             if( $rt == 'number' ){
                                 return $array;
                             }else{
                                $array = explode(',', $array);
                                $mang  = array();
                                foreach( $array as $val ){
                                    $mang[] = $this->saohungtinh_thangam_canngay_chingay[$val];
                                }
                                return $mang;
                             }
                        }
    }
    
    /** XAC DINH CAT TINH NHAT THAN THEO THANG AM VA CAN NGAY **/
    public function xacdinh_cattinhnhatthan_tcan( $rt = 'number' ){
                        $key    = $this->thangam . ',' . $this->canngay;
                        if( isset( $this->xd_cattinhnhatthan_thangam_canngay[ $key ] ) ){
                            $number = $this->xd_cattinhnhatthan_thangam_canngay[ $key ];
                            if( $rt == 'number' ){
                                return $number;
                            }else{
                                 $mang = array();
                                 $arr = explode( ',', $number );
                                 foreach( $arr as $val ){
                                    $mang[] = $this->cattinhnhatthan_thangam_canngay[ $val ];
                                 }
                                 return $mang;
                            }
                        }
                        
    }
    
    /** XAC DINH CAT TINH NHAT THAN THEO THANG AM VA CHI NGAY **/
    public function xacdinh_cattinhnhatthan_tchi( $rt = 'number' ){
                        $key    = $this->thangam . ',' . $this->chingay;
                        if( isset($this->xd_cattinhnhatthan_thangam_chingay[ $key ] ) ){
                            $number = $this->xd_cattinhnhatthan_thangam_chingay[ $key ];
                            if( $rt == 'number' ){
                                return $number;
                            }else{
                                 $mang = array();
                                 $arr = explode( ',', $number );
                                 foreach( $arr as $val ){
                                    if( isset( $this->cattinhnhatthan_thangam_chingay[ $val ] ) )
                                    $mang[] = $this->cattinhnhatthan_thangam_chingay[ $val ];
                                 }
                                 return $mang;
                            }
                        }
                        
                        
    }
    
    /** XAC DINH CAT TINH NHAT THAN DAC BIET **/
    public function xacdinh_cattinhnhatthan_dacbiet( $rt = 'number' ){
                         $thangcan = $this->thangam.','.$this->canngay;
                         $thangchi = $this->thangam.','.$this->chingay;
                         $thangcanchi = $this->thangam.','.$this->canngay.','.$this->chingay;
                         $array = array();
                         if( isset( $this->xd_cattinhnhatthandacbiet_thangam_canngay[ $thangcan ] ) ){
                             $array[] = $this->xd_cattinhnhatthandacbiet_thangam_canngay[ $thangcan ];
                         }
                         if( isset( $this->xd_cattinhnhatthandacbiet_thangam_chingay[ $thangchi ] ) ){
                             $array[] = $this->xd_cattinhnhatthandacbiet_thangam_chingay[ $thangchi ];
                         }
                         if( isset( $this->xd_cattinhnhatthandacbiet_thangam_canngay_chingay[ $thangcanchi ] ) ){
                             $array[] = $this->xd_cattinhnhatthandacbiet_thangam_canngay_chingay[ $thangcanchi ];
                         }
                         if( $rt == 'number' ){
                              return $array;
                         }else{
                             $mang = array();
                             foreach( $array as $val ){
                                $mang[] = $this->cattinhnhatthan_thangam_canngay_chingay[ $val ];
                             } 
                             return $mang;
                         }
                         
                         
                         
    }
    
    /** XAC DINH TRUC NGAY **/
    public function xacdinh_trucngay( $tietkhi, $rt = 'number' ){
                           $key = $tietkhi.','. $this->chingay;
                           
                           $number = $this->xd_trucngay[ $key ];
                           if( $rt == 'number' ){
                               return $number;
                           }else{
                               return $this->mang_trucngay[ $number ]; 
                           }
    }
    
    /** XAC DINH NGAY HOANG DAO **/
    public function xacdinh_ngayhoangdao(){
                        $key    = $this->thangam . ',' . $this->chingay;
                        if( isset( $this->xd_ngayhoangdao[ $key ] ) ){
                            return $this->xd_ngayhoangdao[ $key ];
                        }else{
                            return false;
                        } 
    } 
    
    /** XAC DINH NGAY HOANG DAO TOT XAU **/
    public function xacdinh_ngayhoangdao_totxau(){
                       $rt = array();
                       if( $this->xacdinh_ngayhoangdao() != false ){
                             if( in_array( $this->xacdinh_ngayhoangdao(), array(1,2,5,6,8,11) ) ){
                                $rt[0] = 'Hoàng đạo';
                                $rt[1] = $this->ngayhoangdao[ $this->xacdinh_ngayhoangdao() ];
                             }else{
                                $rt[0] = 'Hắc đạo';
                                $rt[1] = $this->ngayhoangdao[ $this->xacdinh_ngayhoangdao() ];
                             }
                       }
                       return $rt;
    }
    
    /** XAC DINH PHUONG VI **/
    
    public function xacdinh_phuongvi_hythan( $rt = 'number' ){
                        if( isset( $this->xd_huong_hythan[ $this->canngay ] ) ){
                              if( $rt == 'number' ){
                                 return $this->xd_huong_hythan[ $this->canngay ];
                              }else{
                                  return $this->phuongvi[ $this->xd_huong_hythan[ $this->canngay ] ];
                              }
                        }
    }
    
    public function xacdinh_phuongvi_taithan( $rt = 'number' ){
                        if( isset( $this->xd_huong_taithan[ $this->canngay ] ) ){
                              if( $rt == 'number' ){
                                 return $this->xd_huong_taithan[ $this->canngay ];
                              }else{
                                  return $this->phuongvi[ $this->xd_huong_taithan[ $this->canngay ] ];
                              }
                        }
    }
    
    public function xacdinh_phuongvi_hacthan( $rt = 'number' ){
                        $key = $this->canngay.','.$this->chingay;
                        if( isset( $this->xd_huong_hacthan[ $key ] ) ){
                              if( $rt == 'number' ){
                                 return $this->xd_huong_hacthan[ $key ];
                              }else{
                                  return $this->phuongvi[ $this->xd_huong_hacthan[ $key ] ];
                              }
                        }
    }
    
    
    /** XEM NGAY DONG THO **/
    public function xemngay_dongtho( $amlich, $canchi ){
                       $saohungtinh_chi    = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                       $saohungtinh_chi    = array_intersect( $saohungtinh_chi, array( 10, 15, 16, 28, 29, 41, 42, 43, 44, 45 ) );
                       $saohungtinh_can    = explode( ',', $this->xacdinh_saohungtinh_tcan() );
                       $saohungtinh_can    = array_intersect( $saohungtinh_can, array( 1 ) );
                       $saohungtinh_canchi = explode( ',', $this->xacdinh_saohungtinh_tcanchi() );
                       $saohungtinh_canchi = array_intersect( $saohungtinh_canchi, array(1) );
                       $thangam_chingay    = $amlich[1].','.$canchi['chi'];
                       $mang_ngaysatchu    = array( '1,6', '2,1', '3,8', '4,4', '5,9', '6,11', '7,12', '8,2', '9,7', '10,10', '11,3', '12,5' );
                       if( !empty( $saohungtinh_chi ) || !empty( $saohungtinh_can ) || !empty( $saohungtinh_canchi ) || in_array( $thangam_chingay, $mang_ngaysatchu ) ){
                           $rt =  'xau';
                       }else{
                           $cattinhnhatthan_tot =array( 3, 37, 38, 39, 40 ); 
                           $cattinhnhatthan_chi = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() );
                           $cattinhnhatthan_chi = array_intersect( $cattinhnhatthan_chi, $cattinhnhatthan_tot  );
                           $ngayhoangdao_tot    = array( 5, 11 );
                           $ngayhoangdao        = $this->xacdinh_ngayhoangdao();
                           if( !empty( $cattinhnhatthan_chi ) ||  in_array( $ngayhoangdao, $ngayhoangdao_tot ) ){
                              $rt = 'tot';
                           }else{
                              $rt = 'bt';
                           }
                       }
                       return $rt;
    }
    
    /** XEM NGAY NHAP TRACH NHA MOI **/
    public function xemngay_nhaptrachnhamoi( $amlich, $canchi ){
                         $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                         $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 15,25 ));
                         $ngayhoadao = $this->xacdinh_ngayhoangdao();
                         $ngay_tot = array( '1,1', '2,2', '3,3', '5,5', '7,7', '4,2', '5,3', '2,10', '7,3', '9,5', '10,6', '2,8', '9,3', '10,4', '1,5', '3,7', '8,12', '10,2', '3,5', '4,6', '9,11' ); 
                         $can_chi  = $canchi['can'].','.$canchi['chi'];
                         if( !empty( $saohungtinh_thangamchingay ) || in_array( $ngayhoadao, array( 4 ) ) ){
                              $rt =  'xau';
                         }elseif( in_array( $can_chi, $ngay_tot ) ){
                              $rt = 'tot';
                         }else{
                             $rt = 'bt';
                         }
                         return $rt;
    }
    
    /** XEM NGAY DO TRAN LOP MAI **/
    public function xemngay_dotranlopmai( ){
                         //echo $this->ngayduong.'<br/>';
                         $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                         $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 3,17,18 ));
                         
                         $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                         $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array(2,3,37,38,39,40 ) );
                         $ngayhoangdao               = $this->xacdinh_ngayhoangdao();
                         $ngay_tot                   = array( 5, 11 );  
                         $cattinhnhatthan_can    = explode( ',', $this->xacdinh_cattinhnhatthan_tcan() );
                         $cattinhnhatthan_can    = array_intersect( $cattinhnhatthan_can, array( 6 ) );
                         
                         if( !empty( $saohungtinh_thangamchingay ) ){
                              $rt =  'xau'; 
                         }elseif( in_array( $ngayhoangdao, $ngay_tot ) || !empty( $cattinhnhatthan_chingay ) || !empty( $cattinhnhatthan_can ) ){
                              $rt = 'tot';
                         }else{
                            $rt = 'bt';
                         }
                         return $rt;
    }
    
    /** XEM NGAY XAY DUNG **/
    public function xemngay_xaydung( $amlich, $canchi ){
                         $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                         $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 7,8,9,10,12,22,35,46 ));
                         $thang_chi                  = $amlich[1].','.$canchi['chi'];
                         $thang_chi_xau              = array( '1,6', '2,1', '3,8', '4,4', '5,9', '6,11', '7,12', '8,2', '9,7', '10,10', '11,3', '12,5' ); 
                         $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                         $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array( 37, 38, 39, 40, 2 ) );
                         $ngayhoangdao               = $this->xacdinh_ngayhoangdao();
                         $ngayhoangdao_tot           = array( 5, 11 );
                         $ngay_tot_xaydung           = array( '6,6', '8,8', '1,11', '2,12', '2,10', '6,10', '9,1', '2,4', '6,8', '9,9' );
                         $can_chi                    = $canchi['can'].','.$canchi['chi'];
                         
                         if( !empty( $saohungtinh_thangamchingay ) || in_array( $thang_chi, $thang_chi_xau ) ){
                                $rt =  'xau'; 
                         }elseif( !empty( $cattinhnhatthan_chingay ) || in_array( $ngayhoangdao, $ngayhoangdao_tot ) || in_array( $can_chi, $ngay_tot_xaydung ) ){
                                $rt = 'tot';
                         }else{
                                $rt = 'bt';
                         }
                         return $rt;
    } 
    
    /** XEM NGAY XUAT HANH **/
    public function xemngay_xuathanh( $amlich, $canchi ){
                         $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                         $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 8,16,19,21,26,29,30 ));
                         $saohungtinh_canchi = explode( ',', $this->xacdinh_saohungtinh_tcanchi() );
                         $saohungtinh_canchi = array_intersect( $saohungtinh_canchi, array(4,5) ); 
                         $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                         $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array( 37,40,39,38,6,29,25 ) );
                         $ngayhoangdao               = $this->xacdinh_ngayhoangdao();
                         $ngayhoangdao_tot           = array(5,11);
                         $ngaydepcanchi = array( '1,1','2,2','3,3','4,4','7,7','8,8','1,11','2,12','4,2','6,4','1,9','3,11','7,3','8,4','1,7','7,1','8,2','9,3','10,4','3,7','4,8','6,10','10,2','1,3','2,4','7,9' );
                         $can_chi  = $canchi['can'].','.$canchi['chi'];
                         if( !empty( $saohungtinh_thangamchingay ) || !empty( $saohungtinh_canchi )  ){
                               $rt = 'xau';
                         }elseif( !empty( $cattinhnhatthan_chingay ) || in_array($ngayhoangdao, $ngayhoangdao_tot) || in_array( $can_chi, $ngaydepcanchi )){
                               $rt = 'tot';
                         }else{
                             $rt = 'bt';
                         }
                         return $rt;
    } 
    
    /** XEM NGAY KHAI TRUONG **/
    public function xemngay_khaitruong( $amlich, $canchi ){
                         $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                         $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 5,6,15,20,29,30 ));
                         $ngayhoangdao               = $this->xacdinh_ngayhoangdao(); 
                         $ngayhoangdao_xau           = array(4);
                         $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                         $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array( 2,6,7,8,9,13,32,33,37,40,39,38 ) );
                         $ngayhoangdao_tot           = array(5,11);
                         $ngaydepcanchi              = array('1,1','2,2','3,3','6,6','7,7','8,8','1,11','2,12','3,1','4,2','9,7','10,8','1,9','7,3','8,4','2,8','6,12','7,1','10,4','3,7','9,1','1,3','2,4','6,8','7,9','8,10');
                         $can_chi  = $canchi['can'].','.$canchi['chi'];
                         if( !empty( $saohungtinh_thangamchingay ) || in_array( $ngayhoangdao, $ngayhoangdao_xau ) ){
                               $rt = 'xau';
                         }elseif( !empty( $cattinhnhatthan_chingay ) || in_array( $ngayhoangdao, $ngayhoangdao_tot) || in_array( $can_chi, $ngaydepcanchi ) ){
                                $rt = 'tot';
                         }else{
                               $rt = 'bt';
                         }
                         return $rt;
    } 
    
    /** XEM NGAY MUA XE **/
    public function xemngay_muaxe( $amlich, $canchi ){
                        $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                        $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 13,38 )); 
                        $ngayhoangdao               = $this->xacdinh_ngayhoangdao(); 
                        $ngayhoangdao_xau           = array( 3,7,10,4,12,9 );
                        $ngayxaucanchi              = array( '1,6', '2,1', '3,8', '4,4', '5,9', '6,11', '7,12', '8,2', '9,7', '10,10', '11,3', '12,5' );
                        $ngayhoangdao_tot           = array( 11,5);
                        $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                        $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array( 37,38,39,40) );
                        $ngaytotcanchi              = array( '2,12', '2,10', '5,1', '9,5', '2,6', '9,1', '6,8' );
                        $can_chi  = $canchi['can'].','.$canchi['chi'];
                        if( in_array( $ngayhoangdao, $ngayhoangdao_xau ) || !empty( $saohungtinh_thangamchingay ) || in_array( $can_chi, $ngayxaucanchi )  ){
                             $rt = 'xau';
                        }elseif( in_array( $ngayhoangdao, $ngayhoangdao_tot ) || !empty( $cattinhnhatthan_chingay ) || in_array( $can_chi, $ngaytotcanchi ) ){
                            $rt = 'tot';
                        }else{
                               $rt = 'bt';
                         }
                        return $rt; 
                        
    }
    
    /** XEM NGAY KY HOP DONG **/
    public function xemngay_kyhopdong( $amlich, $canchi ){
                        $ngaytotcanchi              = array( '8,8', '3,1', '4,2', '9,7', '10,8', '1,9', '8,4','9,5','2,8','7,1','10,4','4,8','5,9','9,1','1,3','2,4','6,8','8,10' );
                        $can_chi  = $canchi['can'].','.$canchi['chi'];
                        if( in_array( $can_chi, $ngaytotcanchi ) ){
                             $rt = 'tot';
                        }else{
                             $rt = 'xau';
                        }  
                        return $rt;
    }
    
    /** XEM NGAY MUA NHA **/
    public function xemngay_muanha( $amlich, $canchi ){
                       $ngayhoangdao               = $this->xacdinh_ngayhoangdao(); 
                       $ngayhoangdao_tot           = array( 1, 2, 5, 6, 8, 11 );
                       $can_chi                    = $canchi['can'].','.$canchi['chi'];
                       $ngaytotcanchi              = array( '8,8', '9,9', '10,10', '4,2', '6,4', '9,7', '1,9', '4,12', '9,5', '2,8', '9,3', '1,5', '2,6', '3,7', '6,10', '7,11','8,12','3,5','6,8', '7,9','8,10');
                       if( in_array( $ngayhoangdao, $ngayhoangdao_tot ) || in_array( $can_chi, $ngaytotcanchi ) ){
                            $rt = 'tot';
                       }else{
                            $rt = 'xau'; 
                       }
                       return $rt;
    }
    
    /** XEM NGAY NHAN CHUC  **/
    public function xemngay_nhanchuc( $amlich, $canchi ){
                       $can_chi                    = $canchi['can'].','.$canchi['chi'];
                       $ngaytotcanchi              = array( '1,1','3,3','4,4','5,5','6,6','7,7','2,12','3,1','6,4','9,7','1,9','2,10','3,11','5,1','10,6','6,12','7,1','9,3','3,7','5,9','7,11','8,12','9,1','10,2','7,9','8,10');
                       if( in_array( $can_chi, $ngaytotcanchi ) ){
                            $rt = 'tot';
                       }else{
                            $rt = 'xau'; 
                       }
                       return $rt;
    }
    /** XEM NGAY HOANG DAO **/
    public function xemngay_hoangdao( $amlich, $canchi ){
                       $hoangdao               = $this->xacdinh_ngayhoangdao(); 
                       $ngayhoangdao = array( 1, 2, 5, 6, 8, 11 );
                       $rt = 'hacdao';
                       if( in_array( $hoangdao, $ngayhoangdao ) ){
                           $rt = 'hoangdao';
                       }
                       return $rt;
    }
    
    
    /** XEM NGAY AN TANG **/
    public function xemngay_antang( $amlich, $canchi ){
                        $saohungtinh_thangcan       = explode( ',', $this->xacdinh_saohungtinh_tcan() );
                        $saohungtinh_thangcan       = array_intersect( $saohungtinh_thangcan, array( 1, 2 ) );
                        $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                        $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 50, 46, 45, 44, 9 )); 
                        $saohungtinh_thangcanchi    = explode( ',',$this->xacdinh_saohungtinh_tcanchi() );
                        $saohungtinh_thangcanchi    = array_intersect( $saohungtinh_thangcanchi, array( 3, 4, 5 ) );
                        
                        $ngayhoangdao               = $this->xacdinh_ngayhoangdao(); 
                        $ngayhoangdao_xau           = array( 3, 4, 7, 9, 10, 12 );
                        $ngayhoangdao_tot           = array( 1, 2, 5, 6, 8, 11 );
                        $ngayxaucanchi              = array( '1,6', '2,1', '3,8', '4,4', '5,9', '6,11', '7,12', '8,2', '9,7', '10,10', '11,3', '12,5' );
                        
                        $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                        $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array( 2 ) );
                        $ngaytotcanchi              = array( '9,9','10,10','9,7','1,9','2,10','3,9','4,10','9,3','3,7','6,10','7,9','8,10' );
                        $can_chi  = $canchi['can'].','.$canchi['chi'];
                        if( !empty( $saohungtinh_thangamchingay ) || !empty( $saohungtinh_thangcan ) || !empty( $saohungtinh_thangcanchi ) || in_array( $ngayhoangdao, $ngayhoangdao_xau )  ){
                             $rt = 'xau';
                        }elseif( in_array( $ngayhoangdao, $ngayhoangdao_tot ) || !empty( $cattinhnhatthan_chingay ) || in_array( $can_chi, $ngaytotcanchi ) ){
                            $rt = 'tot';
                        }else{
                               $rt = 'bt';
                         }
                        return $rt;    
    }
    
    /** XEM NGAY KET HON **/
    public function xemngay_kethon( $amlich, $canchi ){
                        $saohungtinh_thangamchingay = explode( ',', $this->xacdinh_saohungtinh_tchi() );
                        $saohungtinh_thangamchingay = array_intersect( $saohungtinh_thangamchingay, array( 4,5 )); 
                        $saohungtinh_thangcanchi    = explode( ',', $this->xacdinh_saohungtinh_tcanchi() );
                        $saohungtinh_thangcanchi    = array_intersect( $saohungtinh_thangcanchi, array( 47, 49, 45, 44, 36, 37, 29, 23, 19 ) );
                        $cattinhnhatthan_chingay    = explode( ',', $this->xacdinh_cattinhnhatthan_tchi() ); 
                        $cattinhnhatthan_chingay    = array_intersect( $cattinhnhatthan_chingay, array( 1, 25, 26, 27, 28 ) );
                        $tietkhi                    = $this->xacdinh_tietkhi('id');  
                        $ngaytotcanchi              = array('3,3','4,4','3,1','5,3','6,4','3,11','5,1','7,3','9,3','10,4','2,6');
                        $can_chi                    = $canchi['can'].','.$canchi['chi'];
                        if( !empty( $saohungtinh_thangamchingay ) || !empty( $saohungtinh_thangcanchi ) ){
                              $rt = 'xau';
                        }elseif(   !empty( $cattinhnhatthan_chingay ) || 
                                   in_array( $can_chi, $ngaytotcanchi )|| 
                                   ( $tietkhi == 1 && in_array( $can_chi, array('3,3','4,4','3,1','6,4','5,1','7,3','8,4') ) ) ||
                                   ( $tietkhi == 2 && in_array( $can_chi, array('2,2','3,1','4,2','3,11','5,1','6,2','5,11','7,1','7,11') ) ) ||
                                   ( $tietkhi == 3 && in_array( $can_chi, array('2,2','4,2','6,2','2,10','4,10','6,10') ) ) ||
                                   ( $tietkhi == 4 && in_array( $can_chi, array('1,1','1,11','3,1','1,9','2,10','3,11','5,1','3,9','4,10','5,11') ) ) ||
                                   ( $tietkhi == 5 && in_array( $can_chi, array('10,10','1,11','10,8','1,9','2,10','3,11','2,8','3,9','5,11','6,8','9,11') ) ) ||
                                   ( $tietkhi == 6 && in_array( $can_chi, array('9,9','10,10','1,11','9,7','10,8','1,9','2,10','1,7','2,8','5,11','6,8','9,11') ) ) ||
                                   ( $tietkhi == 7 && in_array( $can_chi, array('6,6','9,9','10,10','9,7','10,8','1,9','2,10','10,6','1,7','2,8','2,6','5,7','6,8') ) ) ||
                                   ( $tietkhi == 8 && in_array( $can_chi, array('5,5','6,6','8,8','8,6','9,7','10,8','1,9','9,5','10,6','1,7','2,8','2,6','5,7','6,8') ) ) ||
                                   ( $tietkhi == 9 && in_array( $can_chi, array('6,6','7,7','8,8','8,6','9,7','10,8','10,4','10,4','5,7','6,8') ) ) ||
                                   ( $tietkhi == 10 && in_array( $can_chi, array('5,5','7,7','5,3','6,4','7,5','9,7','7,3','8,4','9,5','9,3,10,4','5,7') ) ) ||
                                   ( $tietkhi == 11 && in_array( $can_chi, array('4,4','5,5','6,6','4,2','6,4,7,5','8,6','9,5','8,2','4,6') ) ) ||
                                   ( $tietkhi == 12 && in_array( $can_chi, array('3,3','4,4','5,5','4,2','5,3','6,4','7,5','7,3','8,4','8,2','3,5') ) )
                               ){
                            $rt = 'tot';
                        }else{
                            $rt = 'bt';
                        }
                        return $rt;
    }
       
    
    
    
    
    
    
                       
}    